poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
#include <Arduino.h>
#include <esp_system.h>
#include <esp_heap_caps.h>
#include <driver/rmt.h>
#include <driver/gpio.h>
#include <Wire.h>
#include <string.h>
#include <math.h>
#include <stdarg.h>
#include <atomic>
#include <SPI.h>
#include <SD.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <ESP32Encoder.h>
#include <WiFi.h>
#include <Preferences.h>
#include <WebServer.h>
#include "wifi_config.h"
#include "runtime_config.h"
#include "dashboard_page.h"
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/queue.h>

// Each device has one owning task. Only the bus and dashboard snapshots
// are shared. Never hold the bus mutex while waiting for a conversion.
std::atomic<bool> supplyBusEnabled{false};
std::atomic<uint32_t> supplyGeneration{0};
SemaphoreHandle_t i2cMutex = nullptr;
SemaphoreHandle_t stateMutex = nullptr;
QueueHandle_t imuCommands = nullptr, mcpCommands = nullptr;
QueueHandle_t sensorCommands = nullptr, logQueue = nullptr, webRecords = nullptr;

const char *resetReasonName(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON: return "POWER_ON";
    case ESP_RST_EXT: return "EXTERNAL_RESET";
    case ESP_RST_SW: return "SOFTWARE_RESET";
    case ESP_RST_PANIC: return "PANIC";
    case ESP_RST_INT_WDT: return "INTERRUPT_WATCHDOG";
    case ESP_RST_TASK_WDT: return "TASK_WATCHDOG";
    case ESP_RST_WDT: return "WATCHDOG";
    case ESP_RST_DEEPSLEEP: return "DEEP_SLEEP";
    case ESP_RST_BROWNOUT: return "BROWNOUT";
    case ESP_RST_SDIO: return "SDIO_RESET";
    default: return "UNKNOWN";
  }
}

struct LogMessage { char text[224]; };
void logf(const char *format, ...) {
  if (SERIAL_IP_ONLY) return;
  LogMessage message{};
  va_list args;
  va_start(args, format);
  vsnprintf(message.text, sizeof(message.text), format, args);
  va_end(args);
  // Logging never blocks acquisition. Console is the sole UART writer
  // after startup; excess diagnostic messages may be dropped.
  if (logQueue) xQueueSend(logQueue, &message, 0);
  else Serial.print(message.text);
}
void logLine(const char *text) { logf("%s\n", text); }

class Lock {
  SemaphoreHandle_t mutex;
  bool held;
public:
  explicit Lock(SemaphoreHandle_t m, TickType_t timeout = portMAX_DELAY)
    : mutex(m), held(m && xSemaphoreTake(m, timeout) == pdTRUE) {}
  ~Lock() { if (held) xSemaphoreGive(mutex); }
  explicit operator bool() const { return held; }
  Lock(const Lock &) = delete;
  Lock &operator=(const Lock &) = delete;
};

struct InaReading {
  bool valid = false;
  uint32_t updatedMs = 0;
  float voltageV = 0, shuntMv = 0, currentA = 0, powerW = 0;
  float rshuntMohm = 0; // Resistance actually used for this reading, in milliohms.
};
struct ImuReading {
  bool valid = false, tiltValid = false, rollValid = false;
  bool yawValid = false, calibrating = true;
  uint32_t updatedMs = 0;
  uint8_t identity = 0;
  unsigned calibrationSamples = 0;
  uint32_t yawReference = 0;
  float ax = 0, ay = 0, az = 0, temperatureC = 0;
  float rollDeg = 0, pitchDeg = 0, yawDeg = 0;
};
struct McpReading {
  bool valid = false, chase = false;
  uint32_t updatedMs = 0;
  uint8_t portA = 0, portB = 0, commandedOutputs = 0;
};
struct RtcReading {
  bool valid = false, running = false, batteryEnabled = false, powerFail = false;
  uint32_t updatedMs = 0;
  int year = 0, month = 0, day = 0, hour = 0, minute = 0, second = 0;
};
struct SupplyReading {
  bool valid = false, present = false, overRange = false;
  uint16_t rawMin = 4095, rawMax = 0;
  unsigned overRangeSamples = 0;
  uint32_t updatedMs = 0;
  float adcMv = 0, voltageV = 0;
};
struct DhtReading {
  bool valid = false;
  uint32_t updatedMs = 0;
  float temperatureC = 0, humidityPct = 0;
};
constexpr int DS_PINS[4] = {27, 16, 13, 14}; // One sensor per independent DATA pin.
enum DsStatus : uint8_t { DS_WAITING, DS_READY, DS_DISABLED, DS_SUPPLY_PAUSED,
                         DS_NOT_FOUND, DS_CONFIG_FAILED, DS_START_FAILED, DS_TIMEOUT, DS_READ_FAILED };
const char *dsStatusName(DsStatus status) {
  const char *names[] = {"WAITING", "READY", "DISABLED", "SUPPLY_PAUSED", "NOT_FOUND",
                         "CONFIG_FAILED", "START_FAILED", "CONVERSION_TIMEOUT", "READ_FAILED"};
  return unsigned(status) < sizeof(names) / sizeof(names[0]) ? names[status] : "UNKNOWN";
}
struct DsReading {
  DsStatus status = DS_WAITING;
  bool parasite = false;
  bool valid = false;
  uint32_t updatedMs = 0;
  float temperatureC = 0;
};
struct EncoderReading {
  bool valid = false, rpmValid = false, speedValid = false;
  uint32_t updatedMs = 0;
  int64_t count = 0;
  float countsPerSecond = 0, shaftRpm = 0, wheelRpm = 0, speedKmh = 0;
};
struct DashboardState {
  InaReading ina[3];
  ImuReading imu;
  McpReading mcp;
  RtcReading rtc;
  SupplyReading supply12v;
  DhtReading dht;
  DsReading ds[4];
  EncoderReading encoder;
};
DashboardState dashboard;

// These runtime switches pause sampling, not electrical power to the devices.
enum DeviceId { DEV_INA1, DEV_INA2, DEV_INA3, DEV_RTC, DEV_IMU, DEV_MCP,
                DEV_DHT, DEV_DS1, DEV_DS2, DEV_DS3, DEV_DS4, DEV_ENCODER, DEV_SD, DEVICE_COUNT };
const char *const deviceNames[] = {"ina1", "ina2", "ina3", "rtc", "imu", "mcp",
                                   "dht", "ds1", "ds2", "ds3", "ds4", "encoder", "sd"};
constexpr uint32_t ALL_DEVICES_MASK = (1U << DEVICE_COUNT) - 1;
std::atomic<uint32_t> enabledDevices{ALL_DEVICES_MASK};
uint32_t deviceControlRevision = 0; // Wi-Fi task owns revision and switch writes.
bool deviceEnabled(unsigned id) { return enabledDevices.load() & (1U << id); }
struct EncoderConfig { float ppr = 360, wheelMm = 100, ratio = 1; };
EncoderConfig encoderConfig; // Protected by stateMutex after setup.
struct ShuntConfig { float mohm[3] = {1.0f, 1.0f, 1.0f}; };
ShuntConfig shuntConfig; // 1 milliohm = 0.001 ohm. Protected by stateMutex.
bool validShuntMohm(float value) { return isfinite(value) && value >= 0.01f && value <= 1000.0f; }
ShuntConfig getShuntConfig() { Lock lock(stateMutex); return shuntConfig; }
EncoderConfig getEncoderConfig() { Lock lock(stateMutex); return encoderConfig; }
constexpr int DEBUG_LED_PIN = 2;
constexpr int DEBUG_LED_ON = HIGH, DEBUG_LED_OFF = LOW;
std::atomic<bool> mcpStopFailed{false};


