poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
// Future HTTP/WebSocket/UI task reads a copy; never reads driver globals.
DashboardState getDashboardSnapshot() {
  Lock lock(stateMutex);
  DashboardState copy = dashboard;
  if (!supplyBusEnabled.load()) {
    for (auto &ina : copy.ina) ina.valid = false;
    copy.imu.valid = copy.imu.yawValid = false;
    copy.mcp.valid = false;
    copy.rtc.valid = false;
    copy.dht.valid = false;
    copy.encoder.valid = copy.encoder.rpmValid = copy.encoder.speedValid = false;
    for (auto &ds : copy.ds) { ds.valid = false; ds.status = DS_SUPPLY_PAUSED; }
  }
  for (unsigned i = 0; i < 3; ++i) if (!deviceEnabled(DEV_INA1 + i)) copy.ina[i].valid = false;
  for (unsigned i = 0; i < 4; ++i) if (!deviceEnabled(DEV_DS1 + i)) { copy.ds[i].valid = false; copy.ds[i].status = DS_DISABLED; }
  if (!deviceEnabled(DEV_IMU)) copy.imu.valid = copy.imu.yawValid = false;
  if (!deviceEnabled(DEV_RTC)) copy.rtc.valid = false;
  if (!deviceEnabled(DEV_MCP)) copy.mcp.valid = false;
  if (!deviceEnabled(DEV_DHT)) copy.dht.valid = false;
  if (!deviceEnabled(DEV_ENCODER)) copy.encoder.valid = copy.encoder.rpmValid = copy.encoder.speedValid = false;
  return copy;
}

uint8_t probeAddress(uint8_t address) {
  Lock lock(i2cMutex, pdMS_TO_TICKS(60));
  if (!lock || !supplyBusEnabled.load()) return 5;
  Wire.beginTransmission(address);
  return Wire.endTransmission(true);
}

// ============================================================
// Settings
// ============================================================
constexpr int SDA_PIN = 21;
constexpr int SCL_PIN = 22;
constexpr uint32_t I2C_SPEED = 100000;
// Temporarily disabled: keep sensor tasks running without an ADC power gate.
constexpr bool SUPPLY_MONITOR_ENABLED = false;
constexpr int VC12V_PIN = 15; // ADC2 on ESP32; dedicated voltage sense input
constexpr float SUPPLY_DIVIDER_RATIO = (100000.0f + 10000.0f) / 10000.0f;
constexpr float SUPPLY_CALIBRATION = 1.0f; // Adjust against a multimeter
constexpr float SUPPLY_ON_V = 10.0f;
constexpr float SUPPLY_OFF_V = 3.5f;
constexpr uint32_t SUPPLY_ADC_MAX_MV = 3300;
constexpr uint16_t SUPPLY_ADC_SATURATION_RAW = 4095;
static_assert(SUPPLY_ON_V > SUPPLY_OFF_V, "Supply thresholds need hysteresis");

constexpr uint8_t MCP_ADDR = 0x27;
constexpr uint8_t RTC_ADDR = 0x6F;

// CH1 = U60, CH2 = U65, CH3 = U66
const uint8_t INA_ADDR[3] = {0x40, 0x45, 0x44};
// Shunt resistance is configured per INA channel from the dashboard.

bool inaReady[3] = {false, false, false};
bool mcpReady = false;
bool imuReady = false;

uint8_t outputMask = 0;
constexpr uint32_t DEFAULT_GA_STEP_MS = 500;
std::atomic<uint32_t> gaStepMs{DEFAULT_GA_STEP_MS};
uint32_t gaPeriodForHz(float hz) {
  return isfinite(hz) && hz >= 0.2f && hz <= 20.0f ? uint32_t(lroundf(1000.0f / hz)) : 0;
}
bool lightChaseRunning = false;
uint8_t lightChasePin = 3;
uint32_t lightChaseLastMs = 0;
void updateLightChase();
uint8_t imuAddress = 0;
uint8_t imuIdentity = 0;
uint8_t imuSample[14] = {};
bool imuSampleValid = false;
unsigned imuReadFailures = 0;
// Use the widest MPU6050/MPU6500 ranges so a fast robot movement is less
// likely to clip and create a visible gap in recorded attitude data.
constexpr uint8_t IMU_GYRO_CONFIG = 0x18;  // +/-2000 degrees/s
constexpr float IMU_GYRO_LSB_PER_DPS = 16.4f;
constexpr uint8_t IMU_ACCEL_CONFIG = 0x18; // +/-16 g
constexpr float IMU_ACCEL_LSB_PER_G = 2048.0f;
float imuFilteredAccel[3] = {};
bool imuFilterReady = false;
uint32_t imuSampleUs = 0;
float yawDeg = 0.0f;
float accelBias[3] = {}, gyroBias[3] = {};
float accelCalibrationSum[3] = {}, gyroCalibrationSum[3] = {};
float previousYawRate = 0.0f;
unsigned imuCalibrationCount = 0;
uint32_t yawReference = 0;
bool imuCalibrated = false, yawContinuous = false;

void updateIMU();

void calibrateIMU() {
  imuCalibrationCount = 0;
  memset(accelCalibrationSum, 0, sizeof(accelCalibrationSum));
  memset(gyroCalibrationSum, 0, sizeof(gyroCalibrationSum));
  imuCalibrated = yawContinuous = false;
  imuFilterReady = false;
  yawDeg = 0.0f;
  imuSampleUs = 0;
  logLine("IMU XYZ: keep robot LEVEL and STILL for about 4 seconds.");
}

const char *imuModel() {
  return imuIdentity == 0x70 ? "MPU6500" :
         imuIdentity == 0x68 ? "MPU6050" : "UNKNOWN IMU";
}

// ============================================================
// I2C helpers
// ============================================================
bool ping(uint8_t address) {
  return probeAddress(address) == 0;
}

bool readBytes(uint8_t address, uint8_t reg,
               uint8_t *data, size_t count) {
  Lock lock(i2cMutex, pdMS_TO_TICKS(60));
  if (!lock || !supplyBusEnabled.load()) return false;
  Wire.beginTransmission(address);
  Wire.write(reg);

  if (Wire.endTransmission(false) != 0) return false;

  if (Wire.requestFrom(address, count, true) != count) {
    while (Wire.available()) Wire.read();
    return false;
  }

  for (size_t i = 0; i < count; i++) {
    data[i] = Wire.read();
  }
  return true;
}

bool writeBytes(uint8_t address, uint8_t reg,
                const uint8_t *data, size_t count) {
  Lock lock(i2cMutex, pdMS_TO_TICKS(60));
  if (!lock || !supplyBusEnabled.load()) return false;
  Wire.beginTransmission(address);
  Wire.write(reg);
  Wire.write(data, count);
  return Wire.endTransmission(true) == 0;
}

bool read8(uint8_t address, uint8_t reg, uint8_t &value) {
  return readBytes(address, reg, &value, 1);
}

bool write8(uint8_t address, uint8_t reg, uint8_t value) {
  return writeBytes(address, reg, &value, 1);
}

bool read16(uint8_t address, uint8_t reg, uint16_t &value) {
  uint8_t data[2];

  if (!readBytes(address, reg, data, 2)) return false;

  value = (uint16_t(data[0]) << 8) | data[1];
  return true;
}

bool write16(uint8_t address, uint8_t reg, uint16_t value) {
  uint8_t data[2] = {
    uint8_t(value >> 8),
    uint8_t(value & 0xFF)
  };

  return writeBytes(address, reg, data, 2);
}

int16_t signed16(const uint8_t *data) {
  return static_cast<int16_t>(
    (uint16_t(data[0]) << 8) | data[1]
  );
}

void scanI2C() {
  unsigned found = 0;
  unsigned errors = 0;

  logLine("\n--- I2C SCAN ---");

  for (uint8_t address = 0x08; address <= 0x77; address++) {
    uint8_t result = probeAddress(address);

    if (result == 0) {
      logf("Found device at 0x%02X\n", address);
      found++;
    } else if (result != 2) {
      logf("Bus error %u at 0x%02X\n", result, address);
      errors++;
    }

