poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
    delay(1);
  }

  logf("Found %u device(s), %u bus error(s)\n",
                found, errors);
}

// ============================================================
// INA226
// ============================================================
bool initINA(uint8_t index) {
  const uint8_t address = INA_ADDR[index];
  uint16_t manufacturer, die;

  if (!read16(address, 0xFE, manufacturer) ||
      !read16(address, 0xFF, die)) {
    logf("INA CH%u [0x%02X]: I2C ERROR\n",
                  unsigned(index + 1), address);
    return false;
  }

  bool valid = manufacturer == 0x5449 &&
               (die == 0x2260 || die == 0x2261);

  logf(
    "INA CH%u [0x%02X]: manufacturer=%04X die=%04X %s\n",
    unsigned(index + 1), address, manufacturer, die,
    valid ? "ID OK" : "UNEXPECTED ID"
  );

  return valid;
}

void sampleINA(uint8_t index) {
  // Keep the previous fresh sample visible while the next conversion runs.
  // Only failed conversions invalidate it; updatedMs advances on success only.
  const auto invalidateReading = [index]() {
    Lock lock(stateMutex);
    dashboard.ina[index].valid = false;
  };
  const uint8_t address = INA_ADDR[index];

  if (!inaReady[index]) {
    inaReady[index] = initINA(index);
    if (!inaReady[index]) { invalidateReading(); return; }
  }

  // AVG=16, bus/shunt conversion time=1.1 ms each.
  // Trigger one complete shunt + bus measurement.
  if (!write16(address, 0x00, 0x4523)) {
    inaReady[index] = false;
    logf("INA CH%u: trigger ERROR\n",
                  unsigned(index + 1));
    invalidateReading(); return;
  }

  bool converted = false;
  uint32_t started = millis();

  while (millis() - started < 250) {
    uint16_t status;

    if (!read16(address, 0x06, status)) {
      inaReady[index] = false;
      logf("INA CH%u: status read ERROR\n",
                    unsigned(index + 1));
      invalidateReading(); return;
    }

    if (status & 0x0008) {
      converted = true;
      break;
    }

    delay(2);
  }

  if (!converted) {
    logf("INA CH%u: conversion TIMEOUT\n",
                  unsigned(index + 1));
    invalidateReading(); return;
  }

  uint16_t rawBus, rawShunt;

  if (!read16(address, 0x02, rawBus) ||
      !read16(address, 0x01, rawShunt)) {
    inaReady[index] = false;
    logf("INA CH%u: measurement read ERROR\n",
                  unsigned(index + 1));
    invalidateReading(); return;
  }

  const int16_t shuntRaw = static_cast<int16_t>(rawShunt);
  const float busV = rawBus * 0.00125f;
  const float shuntV = shuntRaw * 0.0000025f;
  const float rshuntMohm = getShuntConfig().mohm[index];
  const float shuntOhms = rshuntMohm * 0.001f;

  if (shuntRaw == INT16_MAX || shuntRaw == INT16_MIN ||
      busV > 36.0f || !validShuntMohm(rshuntMohm)) {
    logf("INA CH%u: OUT OF RANGE / INVALID SHUNT\n",
                  unsigned(index + 1));
    invalidateReading(); return;
  }

  // Calculate from shunt voltage; calibration register unused.
  const float currentA = shuntV / shuntOhms;
  const float powerW = busV * currentA;

  InaReading value;
  value.valid = true;
  value.updatedMs = millis();
  value.voltageV = busV;
  value.shuntMv = shuntV * 1000.0f;
  value.currentA = currentA;
  value.powerW = powerW;
  value.rshuntMohm = rshuntMohm;
  Lock lock(stateMutex);
  // A setting change during this sample must not publish old calibration as new.
  if (shuntConfig.mohm[index] != rshuntMohm || !deviceEnabled(DEV_INA1 + index)) value.valid = false;
  dashboard.ina[index] = value;
}

// ============================================================
// MCP23017
//
// GPA0 -> U45 -> OP3 / CN15
// GPA1 -> U44 -> OP2 / CN16
// GPA2 -> U43 -> OP1 / CN17
// GPA3 -> U42 -> OP0 / CN18
//
// GPB0..5 -> H1 inputs with internal pull-ups.
// Unused GPA7 and GPB7 are configured as output LOW.
// ============================================================
bool initMCP() {
  lightChaseRunning = false;
  mcpReady = false;

  if (!ping(MCP_ADDR)) return false;

  // Normalize BANK=0.
  // In BANK=1, 0x05 is IOCON.
  // In BANK=0, 0x05 is GPINTENB.
  if (!write8(MCP_ADDR, 0x05, 0x00) ||
      !write8(MCP_ADDR, 0x0A, 0x00)) return false;

  // Disable interrupts and polarity inversion.
  if (!write8(MCP_ADDR, 0x04, 0x00) ||
      !write8(MCP_ADDR, 0x05, 0x00) ||
      !write8(MCP_ADDR, 0x02, 0x00) ||
      !write8(MCP_ADDR, 0x03, 0x00)) return false;

  // Set output latches LOW before enabling output pins.
  if (!write8(MCP_ADDR, 0x14, 0x00) ||
      !write8(MCP_ADDR, 0x15, 0x00)) return false;

  // A0..3 outputs, A4..6 inputs, A7 output.
  // B0..6 inputs, B7 output.
  if (!write8(MCP_ADDR, 0x00, 0x70) ||
      !write8(MCP_ADDR, 0x01, 0x7F) ||
      !write8(MCP_ADDR, 0x0C, 0x70) ||
      !write8(MCP_ADDR, 0x0D, 0x7F)) return false;

  uint8_t dirA, dirB;

  if (!read8(MCP_ADDR, 0x00, dirA) ||
      !read8(MCP_ADDR, 0x01, dirB)) return false;

  outputMask = 0;
  mcpReady = dirA == 0x70 && dirB == 0x7F;
  return mcpReady;
}

void setOutputs(uint8_t mask) {
  if (!mcpReady) {
    logLine("MCP: NOT READY; send r to initialize");
    return;
  }

  mask &= 0x0F;

  if (!write8(MCP_ADDR, 0x14, mask)) {
    lightChaseRunning = false;
    mcpReady = false;
    logLine("MCP: output write ERROR");
    return;
  }

  outputMask = mask;
  logf("MCP output command = 0x%02X\n", outputMask);
}

void startLightChase() {
  if (!mcpReady) {
    logLine("Light chase: MCP not ready; send r to initialize");
    return;
  }
  lightChasePin = 3;
  setOutputs(uint8_t(1U << lightChasePin));
  lightChaseRunning = mcpReady;
  lightChaseLastMs = millis();
  if (lightChaseRunning) {
    logLine("Light chase ON: GA3 -> GA2 -> GA1 -> GA0; 0 stops");
  }
}

void updateLightChase() {
  if (!lightChaseRunning || !mcpReady) return;
  const uint32_t now = millis();
  if (uint32_t(now - lightChaseLastMs) < gaStepMs.load()) return;

  // One output HIGH at a time. No blocking delay or catch-up flashes.
  lightChasePin = lightChasePin == 0 ? 3 : lightChasePin - 1;
  setOutputs(uint8_t(1U << lightChasePin));
  lightChaseLastMs = millis();
}

void sampleMCP() {
  McpReading value;
  value.chase = lightChaseRunning;
  value.commandedOutputs = outputMask;
  value.valid = mcpReady && read8(MCP_ADDR, 0x12, value.portA) &&
                read8(MCP_ADDR, 0x13, value.portB);
  if (!value.valid) { mcpReady = false; lightChaseRunning = false; value.chase = false; }
  value.updatedMs = millis();
  Lock lock(stateMutex);
  dashboard.mcp = value;
}

