poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
// ============================================================
// MCP7940N RTC
// ============================================================
uint8_t toBCD(int value) {
  return uint8_t((value / 10) * 16 + value % 10);
}

int fromBCD(uint8_t value) {
  return (value >> 4) * 10 + (value & 0x0F);
}

bool validBCD(uint8_t value, int minimum, int maximum) {
  int decoded = fromBCD(value);

  return (value & 0x0F) <= 9 &&
         (value >> 4) <= 9 &&
         decoded >= minimum &&
         decoded <= maximum;
}

bool setRTCFromCompileTime() {
  char monthName[4];
  int day, year, hour, minute, second;

  if (sscanf(__DATE__, "%3s %d %d",
             monthName, &day, &year) != 3 ||
      sscanf(__TIME__, "%d:%d:%d",
             &hour, &minute, &second) != 3) {
    return false;
  }

  const char *months = "JanFebMarAprMayJunJulAugSepOctNovDec";
  const char *position = strstr(months, monthName);

  if (!position || year < 2000 || year > 2099) return false;

  const int month = (position - months) / 3 + 1;

  // Sunday=1 ... Saturday=7.
  const int offsets[] = {
    0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4
  };

  int y = year - (month < 3);

  int weekday =
    (y + y / 4 - y / 100 + y / 400 +
     offsets[month - 1] + day) % 7 + 1;

  uint8_t control, secondsReg, weekdayReg;

  if (!read8(RTC_ADDR, 0x07, control) ||
      !read8(RTC_ADDR, 0x00, secondsReg)) return false;

  // Select crystal operation and stop oscillator.
  if (!write8(RTC_ADDR, 0x07, control & ~0x08) ||
      !write8(RTC_ADDR, 0x00, secondsReg & 0x7F)) {
    return false;
  }

  uint32_t started = millis();

  while (true) {
    if (!read8(RTC_ADDR, 0x03, weekdayReg)) return false;
    if (!(weekdayReg & 0x20)) break;

    if (millis() - started > 1000) return false;
    delay(2);
  }

  // 24-hour mode, battery backup enabled.
  // Setting the time explicitly clears the old PWRFAIL flag.
  uint8_t data[7] = {
    toBCD(second),
    toBCD(minute),
    toBCD(hour),
    uint8_t(weekday | 0x08),
    toBCD(day),
    toBCD(month),
    toBCD(year % 100)
  };

  if (!writeBytes(RTC_ADDR, 0x00, data, sizeof(data))) {
    return false;
  }

  // ST=1: start oscillator.
  if (!write8(RTC_ADDR, 0x00, toBCD(second) | 0x80)) {
    return false;
  }

  started = millis();

  while (millis() - started < 2000) {
    if (!read8(RTC_ADDR, 0x03, weekdayReg)) return false;

    if (weekdayReg & 0x20) {
      logf("RTC set to compile time: %s %s\n",
                    __DATE__, __TIME__);
      return true;
    }

    delay(10);
  }

  return false;
}

void sampleRTC() {
  const auto invalidate = []() { Lock lock(stateMutex); dashboard.rtc.valid = false; };
  uint8_t data[7], secondAgain;
  bool stable = false;

  // Avoid displaying a mixed timestamp across a second rollover.
  for (int attempt = 0; attempt < 3; attempt++) {
    if (!readBytes(RTC_ADDR, 0x00, data, sizeof(data)) ||
        !read8(RTC_ADDR, 0x00, secondAgain)) {
      logLine("RTC: I2C read ERROR");
      invalidate(); return;
    }

    if ((data[0] & 0x7F) == (secondAgain & 0x7F)) {
      stable = true;
      break;
    }
  }

  if (!stable) {
    logLine("RTC: unstable time read");
    invalidate(); return;
  }

  const bool mode12 = (data[2] & 0x40) != 0;
  const uint8_t hourBCD = data[2] & (mode12 ? 0x1F : 0x3F);

  bool valid =
    validBCD(data[0] & 0x7F, 0, 59) &&
    validBCD(data[1] & 0x7F, 0, 59) &&
    validBCD(hourBCD, mode12 ? 1 : 0, mode12 ? 12 : 23) &&
    validBCD(data[4] & 0x3F, 1, 31) &&
    validBCD(data[5] & 0x1F, 1, 12) &&
    validBCD(data[6], 0, 99);

  if (!valid) {
    logLine("RTC: invalid/unset date; send t to set time");
    invalidate(); return;
  }

  int year = 2000 + fromBCD(data[6]);
  int month = fromBCD(data[5] & 0x1F);
  int day = fromBCD(data[4] & 0x3F);

  const uint8_t monthDays[] = {
    31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31
  };

  int maxDay = monthDays[month - 1];
  if (month == 2 && year % 4 == 0) maxDay = 29;

  if (day > maxDay) {
    logLine("RTC: invalid calendar date; send t");
    invalidate(); return;
  }

  int hour = fromBCD(hourBCD);

  if (mode12) {
    hour %= 12;
    if (data[2] & 0x20) hour += 12;
  }

  RtcReading value;
  value.valid = true;
  value.updatedMs = millis();
  value.year = year; value.month = month; value.day = day; value.hour = hour;
  value.minute = fromBCD(data[1] & 0x7F);
  value.second = fromBCD(data[0] & 0x7F);
  value.running = (data[3] & 0x20) != 0;
  value.batteryEnabled = (data[3] & 0x08) != 0;
  value.powerFail = (data[3] & 0x10) != 0;
  Lock lock(stateMutex);
  dashboard.rtc = value;
}

// ============================================================
// MPU6050 / MPU6500 (identified by WHO_AM_I, not I2C address)
// ============================================================
// Report transport failures separately from a responding, unsupported chip.
bool probeIMU(uint8_t address, bool &acknowledged) {
  const uint8_t result = probeAddress(address);
  acknowledged = result == 0;

  if (!acknowledged) {
    logf("IMU [0x%02X]: %s (Wire error=%u)\n", address,
                  result == 2 ? "NO ACK" : "BUS ERROR", result);
    return false;
  }

  uint8_t id;
  if (!read8(address, 0x75, id)) {
    logf("IMU [0x%02X]: ACK, but WHO_AM_I read FAILED\n", address);
    return false;
  }

  logf("IMU [0x%02X]: ACK, WHO_AM_I=0x%02X (supported: 0x68 / 0x70)\n",
                address, id);
  if (id != 0x68 && id != 0x70) {
    logLine("IMU: unsupported identity; check module marking/model.");
    return false;
  }
  imuIdentity = id;
  logf("IMU: identified as %s\n", imuModel());
  return true;
}

bool initIMU() {
  imuReadFailures = 0;
  imuFilterReady = false;
  imuReady = false;
  imuSampleValid = false;
  imuAddress = 0;
  imuIdentity = 0;

  const uint8_t candidates[] = {0x68, 0x69};
  bool anyAcknowledged = false;

  for (uint8_t address : candidates) {
    bool acknowledged = false;
    bool supported = probeIMU(address, acknowledged);
    anyAcknowledged |= acknowledged;
    if (supported) {
      imuAddress = address;
      break;
    }
  }

  if (imuAddress == 0) {
    if (anyAcknowledged) {
      logLine("IMU: device responds, but no supported identity verified.");
    } else {
      logLine("IMU: neither 0x68 nor 0x69 acknowledged.");
      logLine("Check module power/GND, SDA/SCL (not XDA/XCL), and AD0.");
    }
    return false;
  }

  if (!write8(imuAddress, 0x6B, 0x80)) {
    logLine("IMU: reset write ERROR");
    return false;
  }

