poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
  delay(100);

  // Wake up, CLKSEL=1 (6050: X gyro PLL; 6500: auto clock), all axes.
  if (!write8(imuAddress, 0x6B, 0x01) ||
      !write8(imuAddress, 0x6C, 0x00)) {
    logLine("IMU: wake-up ERROR");
    return false;
  }

  delay(100);

  // Disable FIFO/internal I2C master.
  // DLPF=3; sample rate=50 Hz. Wide ranges retain fast impacts/turns instead
  // of clipping them; filtering below still keeps the displayed data stable.
  if (!write8(imuAddress, 0x6A, 0x00) ||
      !write8(imuAddress, 0x23, 0x00) ||
      !write8(imuAddress, 0x1A, 0x03) ||
      !write8(imuAddress, 0x19, 0x13) ||
      !write8(imuAddress, 0x1B, IMU_GYRO_CONFIG) ||
      !write8(imuAddress, 0x1C, IMU_ACCEL_CONFIG)) {
    logLine("IMU: configuration write ERROR");
    return false;
  }

  uint8_t power, gyroConfig, accelConfig;

  // MPU6500 has a separate accelerometer filter register.
  // ACCEL_FCHOICE_B=0, A_DLPFCFG=3; do not write this on MPU6050.
  if (imuIdentity == 0x70) {
    uint8_t accelFilter;
    if (!write8(imuAddress, 0x1D, 0x03) ||
        !read8(imuAddress, 0x1D, accelFilter)) {
      logLine("MPU6500: accelerometer filter I2C ERROR");
      return false;
    }
    if ((accelFilter & 0x0F) != 0x03) {
      logf("MPU6500: ACCEL_CONFIG2=0x%02X; expected low bits 0x03\n",
                    accelFilter);
      return false;
    }
  }

  if (!read8(imuAddress, 0x6B, power) ||
      !read8(imuAddress, 0x1B, gyroConfig) ||
      !read8(imuAddress, 0x1C, accelConfig)) {
    logLine("IMU: configuration read ERROR");
    return false;
  }

  if (power != 0x01 ||
      gyroConfig != IMU_GYRO_CONFIG ||
      accelConfig != IMU_ACCEL_CONFIG) {
    logf("IMU: configuration MISMATCH: PWR=0x%02X "
                  "GYRO=0x%02X ACCEL=0x%02X; expected 01/%02X/%02X\n",
                  power, gyroConfig, accelConfig, IMU_GYRO_CONFIG, IMU_ACCEL_CONFIG);
    return false;
  }

  delay(100);

  imuReady = true;
  calibrateIMU();
  logf("%s [0x%02X]: READY\n", imuModel(), imuAddress);
  return true;
}

// Integrate rotation about the board Z axis at approximately 50 Hz.
// Relative rotation about body Z, not an earth-frame/compass heading.
void updateIMU() {
  if (!imuReady) return;
  uint32_t now = micros();
  if (!readBytes(imuAddress, 0x3B, imuSample, sizeof(imuSample))) {
    imuSampleValid = false;
    // A transient bus failure must not trigger a 300 ms device reset.
    // The next valid sample checks the actual elapsed time before integrating.
    if (++imuReadFailures >= 3) {
      imuReady = yawContinuous = false;
      imuFilterReady = false;
    }
    return;
  }
  now = micros();
  const float dt = imuSampleUs ? uint32_t(now - imuSampleUs) * 1e-6f : 0.0f;
  imuSampleUs = now;
  imuSampleValid = true;
  imuReadFailures = 0;
  float rawAccel[3], rawGyro[3];
  for (unsigned i = 0; i < 3; ++i) {
    rawAccel[i] = signed16(&imuSample[i * 2]) / IMU_ACCEL_LSB_PER_G;
    rawGyro[i] = signed16(&imuSample[8 + i * 2]) / IMU_GYRO_LSB_PER_DPS;
  }
  // 50 ms low-pass for displayed acceleration/tilt, using actual sample time.
  const float alpha = dt > 0 ? dt / (0.05f + dt) : 1.0f;
  for (unsigned i = 0; i < 3; ++i) {
    const float corrected = rawAccel[i] - (imuCalibrated ? accelBias[i] : 0.0f);
    if (!imuFilterReady || dt > 0.1f) imuFilteredAccel[i] = corrected;
    else imuFilteredAccel[i] += alpha * (corrected - imuFilteredAccel[i]);
  }
  imuFilterReady = true;

  if (!imuCalibrated) {
    // One stationary, level calibration measures zero-rate gyro bias on X/Y/Z
    // and accelerometer offsets on X/Y/Z (Z retains the expected +1 g gravity).
    for (unsigned i = 0; i < 3; ++i) {
      accelCalibrationSum[i] += rawAccel[i];
      gyroCalibrationSum[i] += rawGyro[i];
    }
    if (++imuCalibrationCount >= 200) {
      for (unsigned i = 0; i < 3; ++i) {
        gyroBias[i] = gyroCalibrationSum[i] / imuCalibrationCount;
        accelBias[i] = accelCalibrationSum[i] / imuCalibrationCount;
      }
      accelBias[2] -= 1.0f;
      for (unsigned i = 0; i < 3; ++i)
        imuFilteredAccel[i] = rawAccel[i] - accelBias[i];
      ++yawReference;
      yawDeg = 0;
      previousYawRate = rawGyro[2] - gyroBias[2];
      imuCalibrated = yawContinuous = true;
      logf("IMU XYZ calibrated: accel bias=%+.4f/%+.4f/%+.4f g; "
           "gyro bias=%+.4f/%+.4f/%+.4f dps; reference=%lu.\n",
           accelBias[0], accelBias[1], accelBias[2],
           gyroBias[0], gyroBias[1], gyroBias[2], (unsigned long)yawReference);
    }
    return;
  }

  const float rate = rawGyro[2] - gyroBias[2];
  const bool gyroClipped = abs(int(signed16(&imuSample[12]))) >= 32760;
  if (dt > 0.1f || gyroClipped) {
    // Skip an interval whose rotation is unknown, but retain the one startup
    // calibration and current relative yaw. Manual 'c' remains available when
    // the user explicitly wants to establish a new gyro bias.
    previousYawRate = rate;
    // Avoid flooding the diagnostics queue during sustained vibration. UART
    // output shares the web core and excessive messages can delay web logging.
    static uint32_t lastSkipLogMs = 0;
    const uint32_t nowMs = millis();
    if (uint32_t(nowMs - lastSkipLogMs) >= 1000) {
      lastSkipLogMs = nowMs;
      logLine(gyroClipped ? "Yaw: gyro clipped; one interval skipped" :
                            "Yaw: sample gap; one interval skipped");
    }
    return;
  }
  if (yawContinuous && dt > 0) {
    yawDeg += 0.5f * (previousYawRate + rate) * dt;
    if (!isfinite(yawDeg)) { calibrateIMU(); return; }
    yawDeg = fmodf(yawDeg + 180.0f, 360.0f);
    if (yawDeg < 0) yawDeg += 360.0f;
    yawDeg -= 180.0f;
  }
  previousYawRate = rate;
}

void publishIMU() {
  // Keep the last successful sample and its timestamp on a short read failure.
  // CSV freshness still expires it; never stamp an old sample as new.
  if (imuReady && !imuSampleValid) return;
  ImuReading value;
  value.valid = imuReady && imuSampleValid;
  value.identity = imuIdentity;
  value.calibrating = !imuCalibrated;
  value.calibrationSamples = imuCalibrationCount;
  value.yawReference = yawReference;
  value.updatedMs = millis();
  if (value.valid) {
    const float ax = imuFilteredAccel[0];
    const float ay = imuFilteredAccel[1];
    const float az = imuFilteredAccel[2];
    value.ax = ax * 9.80665f; value.ay = ay * 9.80665f; value.az = az * 9.80665f;
    value.temperatureC = imuIdentity == 0x70
      ? signed16(&imuSample[6]) / 333.87f + 21.0f
      : signed16(&imuSample[6]) / 340.0f + 36.53f;
    const float norm = sqrtf(ax * ax + ay * ay + az * az);
    const float yz = sqrtf(ay * ay + az * az);
    const bool clipped = abs(int(signed16(&imuSample[0]))) >= 32760 ||
                         abs(int(signed16(&imuSample[2]))) >= 32760 ||
                         abs(int(signed16(&imuSample[4]))) >= 32760;
    value.tiltValid = norm >= 0.85f && norm <= 1.15f && !clipped;
    value.rollValid = value.tiltValid && yz >= 0.02f;
    value.rollDeg = atan2f(ay, az) * 57.2957795f;
    value.pitchDeg = atan2f(-ax, yz) * 57.2957795f;
    value.yawValid = imuCalibrated && yawContinuous;
    value.yawDeg = yawDeg;
  }
  Lock lock(stateMutex);
  dashboard.imu = value;
}

