poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
// ============================================================
// Commands / initialization
// ============================================================
void printHelp() {
  logLine("\n--- COMMANDS ---");
  logLine("1 : GA0 ON -> OP3 / CN15; other outputs OFF");
  logLine("2 : GA1 ON -> OP2 / CN16; other outputs OFF");
  logLine("3 : GA2 ON -> OP1 / CN17; other outputs OFF");
  logLine("4 : GA3 ON -> OP0 / CN18; other outputs OFF");
  logLine("0 : Stop light chase; all GA0..3 outputs OFF");
  logLine("l : Start light chase GA3 -> GA2 -> GA1 -> GA0 (500 ms)");
  logLine("t : Set RTC to sketch compile time");
  logLine("s : Scan I2C");
  logLine("i : Diagnose and reinitialize only MPU6050 / MPU6500");
  logLine("r : Reinitialize sensors and MCP; outputs OFF");
  logLine("h : Show commands");
  logLine("c : Calibrate accelerometer + gyroscope XYZ; keep robot level/still");
  logLine("z : Set relative yaw to zero while board is still");
}

void initializeDevices() {
  logLine("\n--- INITIALIZE ---");

  // Initialize MCP first so output commands start OFF.
  mcpReady = initMCP();
  logf("MCP [0x27]: %s\n",
                mcpReady ? "CONFIG OK; outputs OFF" : "INIT FAILED");

  for (uint8_t i = 0; i < 3; i++) {
    inaReady[i] = initINA(i);
  }

  // Preserve the RTC's existing date and time.
  logf("RTC [0x6F]: %s\n",
                ping(RTC_ADDR) ? "ACK" : "NOT FOUND");

  initIMU();
}

bool enqueueCommand(QueueHandle_t queue, char command) {
  if (xQueueSend(queue, &command, 0) == pdTRUE) return true;
  logf("Command %c rejected: queue full; retry\n", command);
  return false;
}

// UI adapters should dispatch commands through these same queues.
void dispatchCommand(char command) {
  if (command >= 'A' && command <= 'Z') command += 'a' - 'A';
  if (!supplyBusEnabled.load() && command != 'h') {
    if (command != '\n' && command != '\r') logLine("I2C paused: supply OFF/UNKNOWN; command rejected");
    return;
  }
  if ((command >= '0' && command <= '4') || command == 'l') {
    if (deviceEnabled(DEV_MCP)) enqueueCommand(mcpCommands, command);
  } else if (command == 'c' || command == 'z' || command == 'i') {
    if (deviceEnabled(DEV_IMU)) enqueueCommand(imuCommands, command);
  } else if (command == 's' || command == 't') {
    enqueueCommand(sensorCommands, command);
  } else if (command == 'r') {
    enqueueCommand(mcpCommands, command);
    enqueueCommand(imuCommands, command);
    enqueueCommand(sensorCommands, command);
  } else if (command == 'h') printHelp();
}

// Fixed-period scheduling without a burst of catch-up samples after a delay.
void waitPeriod(TickType_t &wake, uint32_t periodMs) {
  TickType_t now = xTaskGetTickCount();
  TickType_t period = pdMS_TO_TICKS(periodMs);
  if (TickType_t(now - wake) >= period) wake = now;
  vTaskDelayUntil(&wake, period);
}

void imuTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  uint32_t lastRetry = millis();
  uint32_t generation = UINT32_MAX;
  for (;;) {
    if (!supplyBusEnabled.load() || !deviceEnabled(DEV_IMU)) {
      generation = UINT32_MAX;
      imuReady = imuSampleValid = yawContinuous = false;
      xQueueReset(imuCommands);
      waitPeriod(wake, 20);
      continue;
    }
    if (generation != supplyGeneration.load()) {
      generation = supplyGeneration.load();
      initIMU();
      lastRetry = millis();
    }
    char command;
    if (xQueueReceive(imuCommands, &command, 0) == pdTRUE) {
      if (command == 'i' || command == 'r') {
        { Lock lock(stateMutex); dashboard.imu.valid = false; }
        initIMU();
        lastRetry = millis();
      } else if (command == 'c' && imuReady) calibrateIMU();
      else if (command == 'z' && imuReady && imuCalibrated) {
        yawDeg = 0; ++yawReference; yawContinuous = true; imuSampleUs = 0;
        logLine("Yaw zero set; relative body Z");
      } else logLine("IMU: not ready or XYZ calibration incomplete");
    }
    if (!imuReady && millis() - lastRetry >= 3000) {
      initIMU();
      lastRetry = millis();
    }
    updateIMU();
    publishIMU();
    waitPeriod(wake, 20);
  }
}

void mcpTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  uint32_t lastRead = 0, lastRetry = 0;
  uint32_t generation = UINT32_MAX;
  bool wasEnabled = true;
  for (;;) {
    if (!deviceEnabled(DEV_MCP)) {
      if (wasEnabled) {
        lightChaseRunning = false;
        // A final OFF command precedes stopping MCP polling.
        uint8_t actual = 0xFF;
        bool ok = supplyBusEnabled.load() && write8(MCP_ADDR, 0x14, 0) &&
                  read8(MCP_ADDR, 0x12, actual) && (actual & 15) == 0;
        mcpStopFailed.store(!ok);
        logLine(ok ? "MCP disabled: GA0..3 OFF readback verified" : "MCP disabled: GA OFF could not be confirmed");
        mcpReady = false; outputMask = 0;
        { Lock lock(stateMutex); dashboard.mcp.valid = false; dashboard.mcp.chase = false; }
      }
      wasEnabled = false; generation = UINT32_MAX; xQueueReset(mcpCommands);
      waitPeriod(wake, 10); continue;
    }
    wasEnabled = true;
    if (!supplyBusEnabled.load()) {
      mcpReady = lightChaseRunning = false;
      outputMask = 0;
      xQueueReset(mcpCommands);
      waitPeriod(wake, 10);
      continue;
    }
    if (generation != supplyGeneration.load() || (!mcpReady && uint32_t(millis() - lastRetry) >= 3000)) {
      generation = supplyGeneration.load();
      lastRetry = millis();
      xQueueReset(mcpCommands); // Never replay commands issued before a bus failure.
      const bool initialized = initMCP();
      mcpStopFailed.store(!initialized); // Restore outputs OFF; do not replay old light commands.
    }
    char command;
    if (xQueueReceive(mcpCommands, &command, 0) == pdTRUE) {
      if (command == 'r') { initMCP(); lastRetry = millis(); }
      else if (command == 'l') startLightChase();
      else if (command >= 'U' && command <= 'X') {
        lightChaseRunning = false;
        setOutputs(outputMask ^ uint8_t(1U << (command - 'U')));
      } else if (command >= 'A' && command <= 'P') {
        lightChaseRunning = false;
        setOutputs(uint8_t(command - 'A'));
      } else {
        lightChaseRunning = false;
        setOutputs(command == '0' ? 0 : uint8_t(1U << (command - '1')));
      }
      lastRead = millis();
      sampleMCP();
    }
    updateLightChase();
    if (millis() - lastRead >= 100) {
      lastRead = millis();
      sampleMCP();
    }
    waitPeriod(wake, 10);
  }
}

// Owned by supplyTask; voltage ADC is independent of the I2C bus.
void sampleSupply() {
  if (!SUPPLY_MONITOR_ENABLED) return; // Never touch ADC2 in manual mode.
  static bool present = false;
  constexpr unsigned SAMPLES = 16;
  uint32_t sumMv = 0;
  bool overRange = false;
  SupplyReading value;
  for (unsigned i = 0; i < SAMPLES; i++) {
    // Separate raw sample detects clipping; calibrated mV supplies scaling.
    const uint16_t raw = analogRead(VC12V_PIN);
    const uint32_t mv = analogReadMilliVolts(VC12V_PIN);
    // The higher software ceiling does not extend the ADC hardware range.
    const bool sampleOverRange = raw >= SUPPLY_ADC_SATURATION_RAW ||
                                 mv > SUPPLY_ADC_MAX_MV;
    overRange |= sampleOverRange;
    if (sampleOverRange) value.overRangeSamples++;
    if (raw < value.rawMin) value.rawMin = raw;
    if (raw > value.rawMax) value.rawMax = raw;
    sumMv += mv;
    vTaskDelay(pdMS_TO_TICKS(1));
  }
  value.updatedMs = millis();
  value.adcMv = float(sumMv) / SAMPLES;
  value.voltageV = value.adcMv * 0.001f * SUPPLY_DIVIDER_RATIO * SUPPLY_CALIBRATION;
  value.overRange = overRange;
  value.valid = !overRange;
  if (value.valid) {
    if (value.voltageV >= SUPPLY_ON_V) present = true;
    else if (value.voltageV < SUPPLY_OFF_V) present = false;
  }
  // Consumers must check valid/freshness before interpreting present.
  value.present = present;
  {
    Lock lock(stateMutex);
    dashboard.supply12v = value;
  }
  // Serialize gate changes with complete bus transactions. A transaction
  // already in progress finishes before OFF; no new transaction starts.
  const bool enable = value.valid && value.present;
  Lock busLock(i2cMutex);
  if (enable != supplyBusEnabled.load()) {
    xQueueReset(imuCommands);
    xQueueReset(mcpCommands);
    xQueueReset(sensorCommands);
    {
      Lock stateLock(stateMutex);
      dashboard.imu.valid = dashboard.imu.yawValid = false;
      dashboard.mcp.valid = false;
      dashboard.mcp.chase = false;
      dashboard.rtc.valid = false;
      for (auto &ina : dashboard.ina) ina.valid = false;
    }
    if (enable) supplyGeneration.fetch_add(1);
    supplyBusEnabled.store(enable);
    logLine(enable ? "Supply ON: I2C resumed; initializing devices"
                   : "Supply OFF/UNKNOWN: I2C paused");
  }
}

void supplyTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  for (;;) {
    sampleSupply();
    waitPeriod(wake, 50);
  }
}

