poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
void sensorTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  uint32_t generation = UINT32_MAX;
  for (;;) {
    if (!supplyBusEnabled.load()) {
      xQueueReset(sensorCommands);
      for (auto &ready : inaReady) ready = false;
      waitPeriod(wake, 50);
      continue;
    }
    if (generation != supplyGeneration.load()) {
      generation = supplyGeneration.load();
      for (auto &ready : inaReady) ready = false;
      { Lock lock(stateMutex);
        dashboard.rtc.valid = false;
        for (auto &ina : dashboard.ina) ina.valid = false;
      }
    }
    char command;
    if (xQueueReceive(sensorCommands, &command, 0) == pdTRUE) {
      if (command == 's') scanI2C();
      else if (command == 't' && deviceEnabled(DEV_RTC)) {
        { Lock lock(stateMutex); dashboard.rtc.valid = false; }
        logLine(setRTCFromCompileTime() ? "RTC set OK" : "RTC set FAILED");
      } else if (command == 'r') {
        for (uint8_t i = 0; i < 3; i++) if (deviceEnabled(DEV_INA1 + i)) inaReady[i] = initINA(i);
      }
    }
    if (deviceEnabled(DEV_RTC)) sampleRTC();
    for (uint8_t i = 0; i < 3; i++) {
      if (deviceEnabled(DEV_INA1 + i)) sampleINA(i);
      else inaReady[i] = false;
    }
    waitPeriod(wake, 500);
  }
}

void printDashboard() {
  const DashboardState state = getDashboardSnapshot();
  const uint32_t now = millis();
  Serial.println("\n--- RTOS dashboard snapshot ---");
  if (!supplyBusEnabled.load()) Serial.println("DHT22: PAUSED (supply OFF/UNKNOWN)");
  else if (!state.dht.updatedMs) Serial.println("DHT22: WARMING UP (GPIO4; wait about 3 seconds)");
  else if (!state.dht.valid || uint32_t(now - state.dht.updatedMs) >= 6500)
    Serial.println("DHT22: READ FAILED / STALE; check GPIO4, power, GND and DATA pull-up");
  else Serial.printf("DHT22 T=%.2f C RH=%.2f %% (GPIO4)\n", state.dht.temperatureC,
                     state.dht.humidityPct);
  for (unsigned i = 0; i < 4; i++) {
    const auto &ds = state.ds[i];
    Serial.printf("DS%u GPIO%d: %s", i+1, DS_PINS[i], dsStatusName(ds.status));
    if (ds.valid) Serial.printf(" T=%.2f C", ds.temperatureC);
    Serial.printf(" power=%s age=%lu ms\n", ds.parasite ? "PARASITE" : "EXTERNAL/UNKNOWN", (unsigned long)(now - ds.updatedMs));
  }
  const auto &enc = state.encoder;
  if (enc.valid) {
    Serial.printf("Encoder count=%lld rate=%+.1f counts/s", (long long)enc.count, enc.countsPerSecond);
    if (enc.rpmValid) Serial.printf(" shaft=%+.2f RPM", enc.shaftRpm);
    else Serial.print(" RPM=CONFIG REQUIRED (PPR)");
    if (enc.speedValid) Serial.printf(" wheel=%+.2f RPM speed=%+.3f km/h", enc.wheelRpm, enc.speedKmh);
    else Serial.print(" speed=CONFIG REQUIRED (wheel/ratio)");
    Serial.println();
  } else Serial.println("Encoder: NOT READY");
  const auto &supply = state.supply12v;
  if (!SUPPLY_MONITOR_ENABLED) {
    Serial.println("12V supply: MONITOR DISABLED (GPIO15 ADC not read)");
    Serial.println("I2C: ENABLED (manual mode; no automatic supply pause)");
  } else if (uint32_t(now - supply.updatedMs) >= 2500) {
    Serial.println("12V supply: STALE");
  } else if (!supply.valid) {
    if (supply.overRange) {
      Serial.printf("12V supply: ADC OVER RANGE | GPIO%d=%.0f mV "
                    "| raw=%u..%u /4095 | high=%u/16\n",
                    VC12V_PIN, supply.adcMv, supply.rawMin, supply.rawMax,
                    supply.overRangeSamples);
    } else Serial.println("12V supply: NOT READY");
  } else {
    Serial.printf("12V supply=%.2f V | status=%s | GPIO%d=%.0f mV | raw=%u..%u\n",
                  supply.voltageV, supply.present ? "ON" : "OFF", VC12V_PIN, supply.adcMv,
                  supply.rawMin, supply.rawMax);
  }
  if (!supplyBusEnabled.load()) {
    Serial.printf("I2C: PAUSED (supply OFF/UNKNOWN); monitoring GPIO%d\n", VC12V_PIN);
    return;
  }
  const auto &rtc = state.rtc;
  if (rtc.valid && uint32_t(now - rtc.updatedMs) < 2500) {
    Serial.printf("RTC %04d-%02d-%02d %02d:%02d:%02d RUN=%u BAT_EN=%u PWRFAIL=%u\n",
      rtc.year, rtc.month, rtc.day, rtc.hour, rtc.minute, rtc.second,
      rtc.running, rtc.batteryEnabled, rtc.powerFail);
  } else Serial.println("RTC: INVALID / STALE");
  for (unsigned i = 0; i < 3; i++) {
    const auto &ina = state.ina[i];
    if (ina.valid && uint32_t(now - ina.updatedMs) < 2500)
      Serial.printf("INA CH%u V=%.4f V Vsh=%+.4f mV I=%+.4f A P=%+.4f W\n",
        i + 1, ina.voltageV, ina.shuntMv, ina.currentA, ina.powerW);
    else Serial.printf("INA CH%u: INVALID / STALE\n", i + 1);
  }
  const auto &mcp = state.mcp;
  if (mcp.valid && uint32_t(now - mcp.updatedMs) < 1000)
    Serial.printf("MCP GA=0x%X GB0..5=0x%02X chase=%u readback=%s\n",
      mcp.portA & 15, mcp.portB & 63, mcp.chase,
      (mcp.portA & 15) == mcp.commandedOutputs ? "OK" : "MISMATCH");
  else Serial.println("MCP: INVALID / STALE");
  const auto &imu = state.imu;
  if (!imu.valid || uint32_t(now - imu.updatedMs) > 200) {
    Serial.println("IMU: INVALID / STALE");
    return;
  }
  Serial.printf("IMU ID=0x%02X Accel[m/s^2] X=%+.3f Y=%+.3f Z=%+.3f Temp=%.2f C\n",
    imu.identity, imu.ax, imu.ay, imu.az, imu.temperatureC);
  if (imu.tiltValid) {
    if (imu.rollValid) Serial.printf("Roll=%+.2f deg ", imu.rollDeg);
    else Serial.print("Roll=UNDEFINED ");
    Serial.printf("Pitch=%+.2f deg\n", imu.pitchDeg);
  } else Serial.println("Tilt: INVALID (acceleration outside range)");
  if (imu.calibrating) Serial.printf("IMU XYZ: CALIBRATING %u/200; level and still\n", imu.calibrationSamples);
  else if (imu.yawValid) Serial.printf("Yaw=%+.2f deg (relative Z; reference=%lu; body Z)\n",
                                      imu.yawDeg, (unsigned long)imu.yawReference);
  else Serial.println("IMU/Yaw: INVALID; keep level and still to recalibrate");
}


// Runtime interval shared by telemetry and SD capture. Wi-Fi task owns NVS writes.
constexpr uint32_t DEFAULT_LOG_INTERVAL_MS = 250;
constexpr uint32_t MIN_LOG_INTERVAL_MS = 100, MAX_LOG_INTERVAL_MS = 60000;
std::atomic<uint32_t> logIntervalMs{DEFAULT_LOG_INTERVAL_MS};
// Bit 0 = recording; remaining bits identify each physical START session.
// Only recordingControlTask writes this token; boot always starts stopped.
constexpr const char *FIRMWARE_BUILD = "20260912-buffered-log-imu-xyz-1";
std::atomic<uint32_t> recordingToken{0};
std::atomic<uint32_t> controlHeartbeatMs{0}, controlStackFree{0};
std::atomic<uint32_t> startPresses{0}, stopPresses{0};
std::atomic<bool> startStable{false}, stopStable{false};
std::atomic<uint32_t> debugBlinkMs{DEFAULT_DEBUG_BLINK_MS};
Preferences logPreferences;
bool logPreferencesReady = false;
bool validLogInterval(uint32_t ms) { return ms >= MIN_LOG_INTERVAL_MS && ms <= MAX_LOG_INTERVAL_MS; }
void loadLogSettings() {
  logPreferencesReady = logPreferences.begin("dashboard", false);
  uint32_t saved = logPreferencesReady ? logPreferences.getUInt("log_ms", DEFAULT_LOG_INTERVAL_MS) : DEFAULT_LOG_INTERVAL_MS;
  logIntervalMs.store(validLogInterval(saved) ? saved : DEFAULT_LOG_INTERVAL_MS);
  uint32_t blink = logPreferencesReady ? logPreferences.getUInt("blink_ms", DEFAULT_DEBUG_BLINK_MS) : DEFAULT_DEBUG_BLINK_MS;
  debugBlinkMs.store(blink >= 40 && blink <= 2000 ? blink : DEFAULT_DEBUG_BLINK_MS);
  const uint32_t gaStep = logPreferencesReady ? logPreferences.getUInt("ga_step_ms", DEFAULT_GA_STEP_MS) : DEFAULT_GA_STEP_MS;
  gaStepMs.store(gaStep >= 50 && gaStep <= 5000 ? gaStep : DEFAULT_GA_STEP_MS);
  EncoderConfig config;
  if (logPreferencesReady && logPreferences.getBytesLength("encoder") == sizeof(config)) {
    logPreferences.getBytes("encoder", &config, sizeof(config));
    if (!isfinite(config.ppr) || config.ppr <= 0 || config.ppr > 100000 ||
        !isfinite(config.wheelMm) || config.wheelMm < 0 || config.wheelMm > 10000 ||
        !isfinite(config.ratio) || config.ratio < 0 || config.ratio > 10000) config = EncoderConfig{};
  }
  encoderConfig = config;
  ShuntConfig shunts;
  if (logPreferencesReady && logPreferences.getBytesLength("shunt") == sizeof(shunts)) {
    logPreferences.getBytes("shunt", &shunts, sizeof(shunts));
    for (auto &value : shunts.mohm) if (!validShuntMohm(value)) value = 1.0f;
  }
  shuntConfig = shunts;
  const uint32_t savedMask = logPreferencesReady ? logPreferences.getUInt("devices", ALL_DEVICES_MASK) : ALL_DEVICES_MASK;
  enabledDevices.store(savedMask & ALL_DEVICES_MASK & (ENABLE_SD_LOGGING ? ALL_DEVICES_MASK : ~(1U << DEV_SD)));
  logf("Device switches restored: mask=0x%04lX\n", (unsigned long)enabledDevices.load());
}
struct LogRecord {
  uint32_t recordingSession = 0;
  uint32_t sequence = 0, capturedMs = 0;
  uint32_t intervalMs = logIntervalMs.load();
  uint32_t devicesMask = enabledDevices.load();
  bool supplyEnabled = false;
  DashboardState state;
};
QueueHandle_t sdRecords = nullptr;
std::atomic<uint32_t> sdDropped{0}, sdWritten{0};
std::atomic<uint32_t> webRecordDropped{0};
std::atomic<bool> sdMounted{false};
std::atomic<const char *> sdStatus{"WAITING_FOR_START"};
std::atomic<uint32_t> sdCardMiB{0};

String csvNumber(float value, bool valid) {
  return valid && isfinite(value) ? String(value, 4) : String("");
}
bool fresh(bool valid, uint32_t now, uint32_t updated, uint32_t limit) {
  return valid && uint32_t(now - updated) < limit;
}
String csvHeader() {
  String text = "sequence,uptime_ms,rtc_datetime,rtc_valid,rtc_age_ms,supply_on,";
  text += "dht22_temp_c,dht22_humidity_pct,dht22_valid,dht22_age_ms";
  for (unsigned i = 1; i <= 3; i++) {
    String prefix = ",ina" + String(i);
    text += prefix + "_voltage_v" + prefix + "_current_a" + prefix + "_power_w";
    text += prefix + "_shunt_mv" + prefix + "_valid" + prefix + "_age_ms" + prefix + "_rshunt_mohm";
  }
  for (unsigned i = 1; i <= 4; i++) {
    String prefix = ",ds" + String(i);
    text += prefix + "_temp_c" + prefix + "_valid" + prefix + "_age_ms" + prefix + "_status";
  }
  text += ",imu_ax_ms2,imu_ay_ms2,imu_az_ms2,imu_temp_c,roll_deg,pitch_deg,yaw_deg";
  text += ",imu_valid,tilt_valid,roll_valid,yaw_valid,imu_age_ms,encoder_count,encoder_counts_s,shaft_rpm,wheel_rpm,speed_kmh,encoder_valid,rpm_valid,speed_valid,encoder_age_ms,supply_voltage_v,supply_adc_mv,supply_valid,dropped_records,yaw_calibrating,yaw_calibration_samples,yaw_reference,record_interval_ms,enabled_devices_mask\n";
  return text;
}
String csvRow(const LogRecord &record) {
  const auto &s = record.state;
  const uint32_t now = record.capturedMs;
  String line;
  line.reserve(1200);
  line += String(record.sequence) + "," + String(now) + ",";
  const bool rtcOK = record.supplyEnabled && s.rtc.running &&
    fresh(s.rtc.valid, now, s.rtc.updatedMs, 2500);
  if (rtcOK) {
    char stamp[24];
    snprintf(stamp, sizeof(stamp), "%04d-%02d-%02d %02d:%02d:%02d",
      s.rtc.year, s.rtc.month, s.rtc.day, s.rtc.hour, s.rtc.minute, s.rtc.second);
    line += stamp;
  }
  line += "," + String(rtcOK) + "," + String(uint32_t(now - s.rtc.updatedMs));
  line += ",";
  if (SUPPLY_MONITOR_ENABLED && fresh(s.supply12v.valid, now, s.supply12v.updatedMs, 1000))
    line += String(s.supply12v.present); // Blank when supply presence is unknown.
  const bool dhtOK = record.supplyEnabled && fresh(s.dht.valid, now, s.dht.updatedMs, 6500);
  line += "," + csvNumber(s.dht.temperatureC, dhtOK);
  line += "," + csvNumber(s.dht.humidityPct, dhtOK);
  line += "," + String(dhtOK) + "," + String(uint32_t(now - s.dht.updatedMs));
  for (const auto &ina : s.ina) {
    const bool ok = record.supplyEnabled && fresh(ina.valid, now, ina.updatedMs, 2500);
    line += "," + csvNumber(ina.voltageV, ok) + "," + csvNumber(ina.currentA, ok);
    line += "," + csvNumber(ina.powerW, ok) + "," + csvNumber(ina.shuntMv, ok);
    line += "," + String(ok) + "," + String(uint32_t(now - ina.updatedMs));
    line += "," + csvNumber(ina.rshuntMohm, ok);
  }
  for (const auto &ds : s.ds) {
    const bool ok = record.supplyEnabled && fresh(ds.valid, now, ds.updatedMs, 2500);
    line += "," + csvNumber(ds.temperatureC, ok) + "," + String(ok);
    line += "," + String(uint32_t(now - ds.updatedMs)) + "," + dsStatusName(ds.status);
  }
  const auto &imu = s.imu;
  const bool imuOK = record.supplyEnabled && fresh(imu.valid, now, imu.updatedMs, 200);
  line += "," + csvNumber(imu.ax, imuOK) + "," + csvNumber(imu.ay, imuOK);
  line += "," + csvNumber(imu.az, imuOK) + "," + csvNumber(imu.temperatureC, imuOK);
  line += "," + csvNumber(imu.rollDeg, imuOK && imu.rollValid);
  line += "," + csvNumber(imu.pitchDeg, imuOK && imu.tiltValid);
  line += "," + csvNumber(imu.yawDeg, imuOK && imu.yawValid);
  line += "," + String(imuOK) + "," + String(imuOK && imu.tiltValid);
  line += "," + String(imuOK && imu.rollValid) + "," + String(imuOK && imu.yawValid);
  line += "," + String(uint32_t(now - imu.updatedMs));
  const auto &enc = s.encoder;
  const bool encOK = record.supplyEnabled && fresh(enc.valid, now, enc.updatedMs, 500);
  char count[32];
  snprintf(count, sizeof(count), "%lld", (long long)enc.count);
  line += ","; if (encOK) line += count;
  line += "," + csvNumber(enc.countsPerSecond, encOK);
  line += "," + csvNumber(enc.shaftRpm, encOK && enc.rpmValid);
  line += "," + csvNumber(enc.wheelRpm, encOK && enc.speedValid);
  line += "," + csvNumber(enc.speedKmh, encOK && enc.speedValid);
  line += "," + String(encOK) + "," + String(encOK && enc.rpmValid);
  line += "," + String(encOK && enc.speedValid) + "," + String(uint32_t(now - enc.updatedMs));
  const bool supplyOK = SUPPLY_MONITOR_ENABLED && fresh(s.supply12v.valid, now, s.supply12v.updatedMs, 1000);
  line += "," + csvNumber(s.supply12v.voltageV, supplyOK);
  line += "," + csvNumber(s.supply12v.adcMv, supplyOK) + "," + String(supplyOK);
  line += "," + String(sdDropped.load());
  line += "," + String(imuOK && imu.calibrating);
  line += "," + String(imu.calibrationSamples) + "," + String(imu.yawReference) + "," + String(record.intervalMs) + "," + String(record.devicesMask) + "\n";
  return line;
}

void logCaptureTask(void *) {
  uint32_t sequence = 0, interval = logIntervalMs.load(), lastCapture = millis();
  uint32_t previousToken = 0;
  for (;;) {
    vTaskDelay(pdMS_TO_TICKS(10));
    const uint32_t token = recordingToken.load(), now = millis();
    const uint32_t requested = logIntervalMs.load();
    if (token != previousToken || requested != interval) {
      // A new recording session or interval creates a new logical CSV file.
      // Its first captured row must always be sequence 1.
      previousToken = token; interval = requested; lastCapture = now; sequence = 0;
    }
    if (!(token & 1) || uint32_t(now - lastCapture) < interval) continue;
    lastCapture += (uint32_t(now - lastCapture) / interval) * interval;
    LogRecord record;
    record.recordingSession = token >> 1;
    record.intervalMs = interval;
    record.sequence = ++sequence;
    record.state = getDashboardSnapshot();
    record.capturedMs = millis();
    record.supplyEnabled = supplyBusEnabled.load();
    if (recordingToken.load() != token) continue;
    if (ENABLE_SD_LOGGING && deviceEnabled(DEV_SD) && xQueueSend(sdRecords, &record, 0) != pdTRUE) sdDropped.fetch_add(1);
    // Browser rendering/network timing must not define the recording cadence.
    // Keep exact firmware-timed samples until /api/state collects them.
    if (xQueueSend(webRecords, &record, 0) != pdTRUE) {
      LogRecord oldest;
      if (xQueueReceive(webRecords, &oldest, 0) == pdTRUE &&
          xQueueSend(webRecords, &record, 0) == pdTRUE) {
        webRecordDropped.fetch_add(1);
      } else {
        webRecordDropped.fetch_add(1);
      }
    }
  }
}

struct DebouncedSwitch {
  int pin;
  bool stable = false, candidate = false;
  uint32_t changedMs = 0;
  void begin(int gpio) {
    pin = gpio; pinMode(pin, INPUT); // GPIO34/39 use the schematic's external pull-ups.
    stable = candidate = digitalRead(pin) == LOW;
    changedMs = millis();
  }
  bool pressed(uint32_t now) {
    const bool value = digitalRead(pin) == LOW;
    if (value != candidate) { candidate = value; changedMs = now; }
    if (candidate != stable && uint32_t(now - changedMs) >= SWITCH_DEBOUNCE_MS) {
      stable = candidate; return stable;
    }
    return false;
  }
};

void recordingControlTask(void *) {
  DebouncedSwitch start, stop;
  start.begin(RECORD_START_PIN); stop.begin(RECORD_STOP_PIN);
  bool led = false;
  uint32_t ledChanged = millis(), priorPeriod = debugBlinkMs.load();
  for (;;) {
    const uint32_t now = millis();
    const bool startPressed = start.pressed(now), stopPressed = stop.pressed(now);
    controlHeartbeatMs.store(now);
    startStable.store(start.stable); stopStable.store(stop.stable);
    if (startPressed) startPresses.fetch_add(1);
    if (stopPressed) stopPresses.fetch_add(1);
    if (now % 1000 < 10) controlStackFree.store(uxTaskGetStackHighWaterMark(nullptr));
    uint32_t token = recordingToken.load();
    // STOP wins when both are pressed. Holding START never restarts after STOP.
    if (stopPressed || stop.stable) token &= ~1u;
    else if (startPressed && !(token & 1)) token = ((token + 2) & ~1u) | 1u;
    const bool starting = (token & 1) && !(recordingToken.load() & 1);
    recordingToken.store(token);
    const uint32_t period = debugBlinkMs.load();
    if (!(token & 1)) {
      if (led) digitalWrite(DEBUG_LED_PIN, DEBUG_LED_OFF);
      led = false; ledChanged = now;
    } else if (starting || period != priorPeriod || uint32_t(now - ledChanged) >= period / 2) {
      led = starting || period != priorPeriod ? true : !led;
      digitalWrite(DEBUG_LED_PIN, led ? DEBUG_LED_ON : DEBUG_LED_OFF);
      ledChanged = now;
    }
    priorPeriod = period;
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

// Set from the encoder specification/mechanics. Zero means unknown, so
// no fabricated RPM or speed is displayed/logged before calibration.
// PPR, wheel diameter and ratio are configured from the dashboard (encoderConfig).
constexpr int ENCODER_SIGN = 1; // Change to -1 to reverse reported direction
ESP32Encoder encoder;

void encoderTask(void *) {
  // Hardware PCNT continues counting during DHT/OneWire timing sections.
  ESP32Encoder::useInternalWeakPullResistors = puType::none; // PCB has 4.7k pull-ups
  encoder.attachFullQuad(32, 33);
  if (!encoder.isAttached()) {
    logLine("Encoder: PCNT attach FAILED");
    vTaskDelete(nullptr);
    return;
  }
  encoder.setFilter(100); // 1.25 us at 80 MHz APB
  encoder.clearCount();
  TickType_t wake = xTaskGetTickCount();
  int64_t previous = 0;
  uint32_t previousUs = micros();
  uint32_t generation = UINT32_MAX;
  for (;;) {
    waitPeriod(wake, 100);
    const int64_t count = encoder.getCount();
    const uint32_t nowUs = micros();
    EncoderReading value;
    value.updatedMs = millis();
    value.count = count * ENCODER_SIGN;
    const float dt = uint32_t(nowUs - previousUs) * 1e-6f;
    const uint32_t currentGeneration = supplyGeneration.load();
    const EncoderConfig config = getEncoderConfig();
    if (deviceEnabled(DEV_ENCODER) && supplyBusEnabled.load() && generation == currentGeneration && dt > 0 && dt < 0.5f) {
      value.valid = true; // Counter active; not proof of a connected sensor
      value.countsPerSecond = (count - previous) * ENCODER_SIGN / dt;
      value.rpmValid = config.ppr > 0;
      if (value.rpmValid) value.shaftRpm = value.countsPerSecond * 60.0f / (config.ppr * 4.0f);
      value.speedValid = value.rpmValid && config.wheelMm > 0 && config.ratio > 0;
      if (value.speedValid) {
        value.wheelRpm = value.shaftRpm / config.ratio;
        value.speedKmh = value.wheelRpm * (3.14159265359f * config.wheelMm / 1000.0f) * 0.06f;
      }
    }
    generation = deviceEnabled(DEV_ENCODER) ? currentGeneration : UINT32_MAX;
    previous = count;
    previousUs = nowUs;
    Lock lock(stateMutex);
    dashboard.encoder = value;
  }
}

constexpr int DHT_PIN = 4;
constexpr int SD_CS = 5, SD_SCK = 18, SD_MISO = 19, SD_MOSI = 23;
// Independent OneWire buses; one sensor per PCB connector.
OneWire dsWire0(DS_PINS[0]), dsWire1(DS_PINS[1]), dsWire2(DS_PINS[2]), dsWire3(DS_PINS[3]);
OneWire *dsWires[4] = {&dsWire0, &dsWire1, &dsWire2, &dsWire3};
DallasTemperature ds0(&dsWire0), ds1(&dsWire1), ds2(&dsWire2), ds3(&dsWire3);
DallasTemperature *dsSensors[4] = {&ds0, &ds1, &ds2, &ds3};
DeviceAddress dsAddress[4] = {};
bool dsFound[4] = {}, dsParasite[4] = {};
String dsMapJson() {
  DeviceAddress copy[4];
  { Lock lock(stateMutex); memcpy(copy, dsAddress, sizeof(copy)); }
  String json = "[";
  for (unsigned i = 0; i < 4; ++i) {
    if (i) json += ",";
    if (!copy[i][0]) { json += "null"; continue; }
    char rom[17];
    for (unsigned j = 0; j < 8; ++j) snprintf(rom + j*2, 3, "%02X", copy[i][j]);
    json += "\"" + String(rom) + "\"";
  }
  return json + "]";
}
// RMT captures DHT timing in hardware; no interrupt-masked pulse polling.
constexpr rmt_channel_t DHT_RMT_CHANNEL = RMT_CHANNEL_0;
RingbufHandle_t dhtRxBuffer = nullptr;
bool initDhtReceiver() {
  if (dhtRxBuffer) return true;
  rmt_config_t config = {};
  config.rmt_mode = RMT_MODE_RX;
  config.channel = DHT_RMT_CHANNEL;
  config.gpio_num = gpio_num_t(DHT_PIN);
  config.clk_div = 80; // 1 us per captured tick at 80 MHz APB.
  config.mem_block_num = 1;
  config.rx_config.filter_en = true;
  config.rx_config.filter_ticks_thresh = 80; // Reject sub-microsecond glitches.
  config.rx_config.idle_threshold = 200; // End frame on a stuck/idle line.
  if (rmt_config(&config) != ESP_OK ||
      rmt_driver_install(DHT_RMT_CHANNEL, 1024, 0) != ESP_OK) return false;
  if (rmt_get_ringbuf_handle(DHT_RMT_CHANNEL, &dhtRxBuffer) != ESP_OK || !dhtRxBuffer) {
    rmt_driver_uninstall(DHT_RMT_CHANNEL);
    dhtRxBuffer = nullptr;
    return false;
  }
  return true;
}

