poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
DhtReading decodeDhtFrame(const rmt_item32_t *items, size_t count) {
  DhtReading value;
  uint8_t data[5] = {};
  // Flatten pairs because the initial host pulse may change item alignment.
  bool responseLow = false, receiving = false, haveLow = false;
  unsigned bits = 0;
  for (size_t n = 0; n < count * 2 && bits < 40; ++n) {
    const auto &item = items[n / 2];
    const unsigned duration = n % 2 ? item.duration1 : item.duration0;
    const unsigned level = n % 2 ? item.level1 : item.level0;
    if (!duration) break;
    if (!receiving) {
      if (responseLow && level == 1 && duration >= 60 && duration <= 110) {
        receiving = true;
      }
      responseLow = level == 0 && duration >= 60 && duration <= 110;
      continue;
    }
    if (!haveLow) {
      if (level != 0 || duration < 30 || duration > 75) return value;
      haveLow = true;
    } else {
      if (level != 1 || duration < 15 || duration > 100) return value;
      data[bits / 8] = (data[bits / 8] << 1) | (duration > 45);
      ++bits; haveLow = false;
    }
  }
  if (bits != 40 || data[4] != uint8_t(data[0] + data[1] + data[2] + data[3])) return value;
  value.humidityPct = ((uint16_t(data[0]) << 8) | data[1]) * 0.1f;
  value.temperatureC = ((uint16_t(data[2] & 0x7f) << 8) | data[3]) * 0.1f;
  if (data[2] & 0x80) value.temperatureC = -value.temperatureC;
  value.valid = value.humidityPct >= 0 && value.humidityPct <= 100 &&
                value.temperatureC >= -40 && value.temperatureC <= 80;
  return value;
}

DhtReading readDht22Bounded() {
  DhtReading value;
  if (!initDhtReceiver()) return value;
  size_t bytes = 0;
  // Discard at most one old frame; the driver is stopped between reads.
  void *old = xRingbufferReceive(dhtRxBuffer, &bytes, 0);
  if (old) vRingbufferReturnItem(dhtRxBuffer, old);
  gpio_set_level(gpio_num_t(DHT_PIN), 1);
  gpio_set_direction(gpio_num_t(DHT_PIN), GPIO_MODE_INPUT_OUTPUT_OD);
  gpio_set_pull_mode(gpio_num_t(DHT_PIN), GPIO_PULLUP_ONLY);
  gpio_set_level(gpio_num_t(DHT_PIN), 0);
  vTaskDelay(pdMS_TO_TICKS(2)); // Start LOW >=1 ms, yielding CPU.
  if (rmt_rx_start(DHT_RMT_CHANNEL, true) != ESP_OK) {
    gpio_set_level(gpio_num_t(DHT_PIN), 1);
    return value;
  }
  gpio_set_level(gpio_num_t(DHT_PIN), 1); // Release open drain, retain RX input.
  auto *items = static_cast<rmt_item32_t *>(xRingbufferReceive(dhtRxBuffer, &bytes, pdMS_TO_TICKS(20)));
  rmt_rx_stop(DHT_RMT_CHANNEL);
  if (items) {
    value = decodeDhtFrame(items, bytes / sizeof(rmt_item32_t));
    vRingbufferReturnItem(dhtRxBuffer, items);
  }
  return value;
}

// DHT has a dedicated owner so DS discovery/conversion cannot delay its cadence.
void dhtTask(void *) {
  bool active = false;
  uint32_t generation = 0, lastRead = 0;
  unsigned failures = 0;
  for (;;) {
    if (!supplyBusEnabled.load() || !deviceEnabled(DEV_DHT)) {
      active = false;
      { Lock lock(stateMutex); dashboard.dht.valid = false; }
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }
    const uint32_t currentGeneration = supplyGeneration.load();
    if (!active || generation != currentGeneration) {
      gpio_set_pull_mode(gpio_num_t(DHT_PIN), GPIO_PULLUP_ONLY);
      active = true; generation = currentGeneration; failures = 0;
      lastRead = millis();
      { Lock lock(stateMutex); dashboard.dht = DhtReading{}; }
    }
    if (uint32_t(millis() - lastRead) >= 2500) {
      DhtReading value = readDht22Bounded();
      lastRead = millis();
      value.updatedMs = lastRead;
      if (value.valid) failures = 0;
      else if (++failures >= 3) { gpio_set_pull_mode(gpio_num_t(DHT_PIN), GPIO_PULLUP_ONLY); failures = 0; }
      Lock lock(stateMutex);
      if (!supplyBusEnabled.load() || !deviceEnabled(DEV_DHT) ||
          generation != supplyGeneration.load()) dashboard.dht.valid = false;
      else if (value.valid) dashboard.dht = value;
      // Failed reads do not refresh the last successful timestamp.
    }
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

void temperatureTask(void *) {
  uint32_t generation = UINT32_MAX;
  for (;;) {
    const uint32_t cycleStart = millis(), cycleGeneration = supplyGeneration.load();
    if (!supplyBusEnabled.load()) {
      { Lock lock(stateMutex);
        for (unsigned i = 0; i < 4; ++i) { dashboard.ds[i].valid = false; dashboard.ds[i].status = DS_SUPPLY_PAUSED; }
      }
      generation = UINT32_MAX;
      vTaskDelay(pdMS_TO_TICKS(100)); continue;
    }
    if (generation != cycleGeneration) {
      generation = cycleGeneration; memset(dsFound, 0, sizeof(dsFound));
    }
    DsReading readings[4];
    bool requested[4] = {}, anyRequested = false;
    uint32_t started[4] = {};
    for (unsigned i = 0; i < 4; ++i) {
      if (!deviceEnabled(DEV_DS1+i)) { readings[i].status = DS_DISABLED; dsFound[i] = false; continue; }
      if (!dsFound[i]) {
        dsSensors[i]->setOneWire(dsWires[i]);
        dsSensors[i]->begin();
        dsSensors[i]->setAutoSaveScratchPad(false);
        dsSensors[i]->setWaitForConversion(false);
        DeviceAddress rom = {};
        for (unsigned j = 0; j < dsSensors[i]->getDeviceCount(); ++j) {
          if (dsSensors[i]->getAddress(rom, j) && rom[0] == 0x28) { dsFound[i] = true; break; }
        }
        { Lock lock(stateMutex);
          if (dsFound[i]) memcpy(dsAddress[i], rom, 8); else memset(dsAddress[i], 0, 8);
        }
        if (!dsFound[i]) { readings[i].status = DS_NOT_FOUND; continue; }
        dsParasite[i] = dsSensors[i]->isParasitePowerMode();
        if (!dsSensors[i]->setResolution(dsAddress[i], 12)) {
          readings[i].status = DS_CONFIG_FAILED; dsFound[i] = false; continue;
        }
      }
      readings[i].parasite = dsParasite[i];
      const auto request = dsSensors[i]->requestTemperaturesByAddress(dsAddress[i]);
      if (!request.result) { readings[i].status = DS_START_FAILED; dsFound[i] = false; continue; }
      started[i] = request.timestamp; requested[i] = true; anyRequested = true;
    }
    if (anyRequested) vTaskDelay(pdMS_TO_TICKS(760));
    if (!supplyBusEnabled.load() || generation != supplyGeneration.load()) continue;
    for (unsigned i = 0; i < 4; ++i) {
      readings[i].updatedMs = millis();
      if (!deviceEnabled(DEV_DS1+i)) { readings[i].status = DS_DISABLED; dsFound[i] = false; continue; }
      if (!requested[i]) continue;
      bool complete = dsParasite[i] || dsSensors[i]->isConversionComplete();
      while (!complete && uint32_t(millis() - started[i]) < 900) {
        vTaskDelay(pdMS_TO_TICKS(5)); complete = dsSensors[i]->isConversionComplete();
      }
      if (!complete) { readings[i].status = DS_TIMEOUT; dsFound[i] = false; continue; }
      const float t = dsSensors[i]->getTempC(dsAddress[i]);
      readings[i].valid = t != DEVICE_DISCONNECTED_C && isfinite(t) && t >= -55 && t <= 125;
      readings[i].temperatureC = t;
      readings[i].status = readings[i].valid ? DS_READY : DS_READ_FAILED;
      if (!readings[i].valid) dsFound[i] = false;
    }
    { Lock lock(stateMutex);
      for (unsigned i = 0; i < 4; ++i) {
        if (!deviceEnabled(DEV_DS1+i)) { readings[i].valid = false; readings[i].status = DS_DISABLED; }
        dashboard.ds[i] = readings[i];
      }
    }
    const uint32_t elapsed = millis() - cycleStart;
    if (elapsed < 1000) vTaskDelay(pdMS_TO_TICKS(1000 - elapsed));
  }
}

