poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
// SD is on the backed-up 3V3SUP rail in the schematic. Keep logging even
// when main supply is OFF; I2C values are blank and supply_on=0 in those rows.
// This task alone owns SPI/SD. No disk operation holds the dashboard mutex.
void sdWriterTask(void *) {
  SPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
  bool mounted = false;
  char path[32] = {};
  uint32_t nextAttempt = 0;
  unsigned session = 1;
  uint32_t activeRecordingSession = 0;
  uint32_t activeInterval = 0, fileSequence = 0;
  for (;;) {
    LogRecord record;
    if (xQueueReceive(sdRecords, &record, pdMS_TO_TICKS(200)) != pdTRUE) continue;
    if (!deviceEnabled(DEV_SD)) continue;
    if (record.recordingSession != activeRecordingSession || record.intervalMs != activeInterval) {
      activeRecordingSession = record.recordingSession;
      activeInterval = record.intervalMs;
      mounted = false; sdMounted.store(false); nextAttempt = 0;
    }
    if (!mounted) {
      if (int32_t(millis() - nextAttempt) < 0) { sdDropped.fetch_add(1); continue; }
      sdStatus.store("MOUNTING");
      sdCardMiB.store(0);
      SD.end();
      mounted = SD.begin(SD_CS, SPI, 4000000);
      if (mounted && SD.cardType() != CARD_NONE) {
        sdCardMiB.store(uint32_t(SD.cardSize() / (1024ULL * 1024ULL)));
        if (!SD.exists("/logs")) mounted = SD.mkdir("/logs");
        bool chosen = false;
        while (mounted && session <= 99999) {
          snprintf(path, sizeof(path), "/logs/log_%05u.csv", session++);
          if (!SD.exists(path)) { chosen = true; break; }
        }
        mounted = mounted && chosen;
        if (mounted) {
          File file = SD.open(path, FILE_WRITE);
          String header = csvHeader();
          mounted = file && file.print(header) == header.length();
          if (file) { file.flush(); mounted = mounted && !file.getWriteError(); file.close(); }
        }
      } else mounted = false;
      sdMounted.store(mounted);
      if (!mounted) {
        sdStatus.store("MOUNT_OR_CREATE_FAILED");
        logLine("SD: mount/create failed; check FAT32 filesystem, card and wiring; retry in 5 seconds");
        nextAttempt = millis() + 5000;
        sdDropped.fetch_add(1);
        continue;
      }
      sdStatus.store("READY");
      fileSequence = 0;
      logf("SD: recording %s; interval=%lu ms\n", path, (unsigned long)record.intervalMs);
    }
    record.sequence = ++fileSequence;
    String line = csvRow(record);
    File file = SD.open(path, FILE_APPEND);
    bool ok = file && file.print(line) == line.length();
    if (file) { file.flush(); ok = ok && !file.getWriteError(); file.close(); }
    if (ok) { sdWritten.fetch_add(1); sdStatus.store("READY"); }
    else {
      mounted = false;
      sdMounted.store(false);
      sdDropped.fetch_add(1);
      nextAttempt = millis() + 5000;
      sdStatus.store("WRITE_FAILED");
      logLine("SD: write failed; record lost, retry with NEW file in 5 seconds");
    }
  }
}


// The Wi-Fi server owns network IO. It never reads I2C directly.
void wifiTask(void *) {
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  WebServer server(80);
  const char *requestHeaders[] = {"X-Dashboard-Request"};
  server.collectHeaders(requestHeaders, 1);
  server.on("/api/health", HTTP_GET, [&]() {
    String json; json.reserve(900);
    json = "{\"reset_reason\":\"";
    json += resetReasonName(esp_reset_reason());
    json += "\",\"uptime_ms\":" + String(millis());
    json += ",\"free_heap_bytes\":" + String(ESP.getFreeHeap());
    json += ",\"min_free_heap_bytes\":" + String(ESP.getMinFreeHeap());
    json += ",\"largest_free_block_bytes\":" + String(heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    const uint32_t token = recordingToken.load();
    json += ",\"firmware\":\"" + String(FIRMWARE_BUILD) + "\"";
    json += ",\"recording\":" + String(token & 1 ? "true" : "false");
    json += ",\"recording_session\":" + String(token >> 1);
    json += ",\"sw1_gpio\":" + String(RECORD_START_PIN);
    json += ",\"sw2_gpio\":" + String(RECORD_STOP_PIN);
    json += ",\"gpio34_raw\":" + String(digitalRead(34));
    json += ",\"gpio39_raw\":" + String(digitalRead(39));
    json += ",\"gpio36_raw\":" + String(digitalRead(36));
    json += ",\"sw1_pressed\":" + String(startStable.load() ? "true" : "false");
    json += ",\"sw2_pressed\":" + String(stopStable.load() ? "true" : "false");
    json += ",\"start_presses\":" + String(startPresses.load());
    json += ",\"stop_presses\":" + String(stopPresses.load());
    json += ",\"control_age_ms\":" + String(uint32_t(millis() - controlHeartbeatMs.load()));
    json += ",\"control_stack_free_bytes\":" + String(controlStackFree.load());
    json += ",\"ds_pins\":[27,16,13,14],\"ds_rom\":" + dsMapJson();
    json += ",\"ga_step_ms\":" + String(gaStepMs.load());
    json += ",\"sd_available\":" + String(ENABLE_SD_LOGGING ? "true" : "false");
    json += ",\"sd_status\":\"" + String(ENABLE_SD_LOGGING && deviceEnabled(DEV_SD) ? sdStatus.load() : "DISABLED") + "\"";
    json += ",\"sd_mounted\":" + String(sdMounted.load() ? "true" : "false");
    json += ",\"sd_card_mib\":" + String(sdCardMiB.load());
    json += ",\"sd_written\":" + String(sdWritten.load());
    json += ",\"sd_dropped\":" + String(sdDropped.load());
    json += ",\"blink_ms\":" + String(debugBlinkMs.load());
    json += ",\"web_core\":" + String(WEB_CORE) + ",\"sensor_core\":" + String(SENSOR_CORE);
    json += "}";
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });
  server.on("/api/led", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    const String raw = server.arg("blink_ms");
    bool digits = raw.length() > 0 && raw.length() <= 4;
    for (unsigned i = 0; i < raw.length(); ++i) digits &= raw[i] >= '0' && raw[i] <= '9';
    const uint32_t value = digits ? raw.toInt() : 0;
    if (value < 40 || value > 2000) { server.send(400, "text/plain", "Use 40-2000 ms per full blink cycle"); return; }
    if (value != debugBlinkMs.load()) {
      if (!logPreferencesReady || logPreferences.putUInt("blink_ms", value) != sizeof(uint32_t)) {
        server.send(500, "text/plain", "Could not save LED setting"); return;
      }
      debugBlinkMs.store(value);
    }
    server.send(200, "application/json", String("{\"blink_ms\":") + debugBlinkMs.load() + "}");
  });
  server.on("/api/settings", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") {
      server.send(403, "text/plain", "Dashboard request required"); return;
    }
    const String raw = server.arg("interval_ms");
    bool digits = raw.length() > 0 && raw.length() <= 5;
    for (unsigned i = 0; i < raw.length(); ++i) digits &= raw[i] >= '0' && raw[i] <= '9';
    const uint32_t value = digits ? uint32_t(raw.toInt()) : 0;
    if (!validLogInterval(value)) {
      server.send(400, "text/plain", "Use an integer from 100 to 60000 ms"); return;
    }
    if (value != logIntervalMs.load()) {
      if (!logPreferencesReady || logPreferences.putUInt("log_ms", value) != sizeof(uint32_t)) {
        server.send(500, "text/plain", "Could not save interval; setting unchanged"); return;
      }
      logIntervalMs.store(value);
      logf("Recording interval saved: %lu ms\n", (unsigned long)value);
    }
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", String("{\"interval_ms\":") + logIntervalMs.load() + "}");
  });
  const String bootId = String(esp_random(), HEX);
  uint32_t webSequence = 0;
  server.on("/api/shunt", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    ShuntConfig config;
    for (unsigned i = 0; i < 3; ++i) {
      const String raw = server.arg(String("ch") + (i + 1)); char *end = nullptr;
      config.mohm[i] = strtof(raw.c_str(), &end);
      if (!raw.length() || end == raw.c_str() || *end || !validShuntMohm(config.mohm[i])) {
        server.send(400, "text/plain", "Each Rshunt must be 0.01..1000 milliohms"); return;
      }
    }
    const ShuntConfig old = getShuntConfig();
    bool changed = false;
    for (unsigned i = 0; i < 3; ++i) changed |= old.mohm[i] != config.mohm[i];
    if (changed) {
      if (!logPreferencesReady || logPreferences.putBytes("shunt", &config, sizeof(config)) != sizeof(config)) {
        server.send(500, "text/plain", "Could not save Rshunt; setting unchanged"); return;
      }
      { Lock lock(stateMutex);
        shuntConfig = config;
        for (unsigned i = 0; i < 3; ++i) if (old.mohm[i] != config.mohm[i]) dashboard.ina[i].valid = false;
      }
      logf("INA Rshunt saved [mOhm]: %.4f / %.4f / %.4f\n", config.mohm[0], config.mohm[1], config.mohm[2]);
    }
    server.send(200, "application/json", "{\"saved\":true}");
  });
  server.on("/api/device", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    int device = -1;
    for (unsigned i = 0; i < DEVICE_COUNT; ++i) if (server.arg("device") == deviceNames[i]) device = i;
    const String enabled = server.arg("enabled");
    if (device < 0 || (enabled != "0" && enabled != "1")) { server.send(400, "text/plain", "Invalid device/state"); return; }
    // Reject commands based on an old page/boot rather than changing an unintended state.
    if (server.arg("boot") != bootId || server.arg("revision") != String(deviceControlRevision)) {
      server.send(409, "text/plain", "Device state changed; wait for fresh status and try again"); return;
    }
    const uint32_t oldMask = enabledDevices.load();
    if (device == DEV_SD && enabled == "1" && !ENABLE_SD_LOGGING) {
      server.send(409, "text/plain", "SD disabled: set ENABLE_SD_LOGGING=true in include/runtime_config.h after installing a card"); return;
    }
    const uint32_t newMask = enabled == "1" ? oldMask | (1U << device) : oldMask & ~(1U << device);
    if (oldMask != newMask) {
      if (!logPreferencesReady || logPreferences.putUInt("devices", newMask) != sizeof(uint32_t)) {
        server.send(500, "text/plain", "Could not save device state; setting unchanged"); return;
      }
      enabledDevices.store(newMask);
      ++deviceControlRevision;
    }
    if (enabled == "0") {
      Lock lock(stateMutex);
      if (device <= DEV_INA3) dashboard.ina[device].valid = false;
      else if (device >= DEV_DS1 && device <= DEV_DS4) dashboard.ds[device - DEV_DS1].valid = false;
      else if (device == DEV_IMU) dashboard.imu.valid = dashboard.imu.yawValid = false;
      else if (device == DEV_RTC) dashboard.rtc.valid = false;
      else if (device == DEV_MCP) dashboard.mcp.valid = false;
      else if (device == DEV_DHT) dashboard.dht.valid = false;
      else if (device == DEV_ENCODER) dashboard.encoder.valid = dashboard.encoder.rpmValid = dashboard.encoder.speedValid = false;
    }
    logf("Device %s: sampling %s\n", deviceNames[device], enabled == "1" ? "enabled" : "disabled");
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", String("{\"boot\":\"") + bootId + "\",\"devices_mask\":" + enabledDevices.load() + ",\"control_revision\":" + deviceControlRevision + "}");
  });
  server.on("/api/ga-frequency", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    const String raw = server.arg("hz"); char *end = nullptr;
    const float hz = strtof(raw.c_str(), &end);
    const uint32_t period = gaPeriodForHz(hz);
    if (!raw.length() || raw.length() > 16 || end == raw.c_str() || *end || !period) {
      server.send(400, "text/plain", "GA step frequency must be 0.2-20 Hz"); return;
    }
    if (period != gaStepMs.load()) {
      if (!logPreferencesReady || logPreferences.putUInt("ga_step_ms", period) != sizeof(uint32_t)) {
        server.send(500, "text/plain", "Could not save GA frequency"); return;
      }
      gaStepMs.store(period);
    }
    server.send(200, "application/json", String("{\"ga_step_ms\":") + gaStepMs.load() + "}");
  });
  server.on("/api/ga", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    if (!deviceEnabled(DEV_MCP) || !supplyBusEnabled.load()) { server.send(409, "text/plain", "MCP is disabled or supply paused"); return; }
    char command = 0;
    if (server.arg("mode") == "chase") command = 'l';
    else if (server.arg("mode") == "toggle") {
      const String channel = server.arg("channel");
      if (channel.length() == 1 && channel[0] >= '0' && channel[0] <= '3') command = 'U' + channel[0] - '0';
    } else {
      const String raw = server.arg("mask");
      bool digits = raw.length() > 0 && raw.length() <= 2;
      for (unsigned i = 0; i < raw.length(); ++i) digits &= raw[i] >= '0' && raw[i] <= '9';
      if (digits && raw.toInt() <= 15) command = 'A' + raw.toInt();
    }
    if (!command) { server.send(400, "text/plain", "Invalid GA command"); return; }
    if (!enqueueCommand(mcpCommands, command)) { server.send(503, "text/plain", "Command queue full"); return; }
    server.send(202, "application/json", "{\"queued\":true}");
  });
  server.on("/api/imu", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") {
      server.send(403, "text/plain", "Dashboard request required"); return;
    }
    if (server.arg("action") != "calibrate") {
      server.send(400, "text/plain", "Invalid IMU action"); return;
    }
    if (!deviceEnabled(DEV_IMU) || !supplyBusEnabled.load()) {
      server.send(409, "text/plain", "IMU is disabled or supply paused"); return;
    }
    const char command = 'c';
    if (!enqueueCommand(imuCommands, command)) {
      server.send(503, "text/plain", "Command queue full"); return;
    }
    server.send(202, "application/json", "{\"queued\":true}");
  });
  server.on("/api/encoder", HTTP_POST, [&]() {
    if (server.header("X-Dashboard-Request") != "1") { server.send(403, "text/plain", "Dashboard request required"); return; }
    EncoderConfig config;
    float *fields[] = {&config.ppr, &config.wheelMm, &config.ratio};
    const char *names[] = {"ppr", "wheel_mm", "ratio"};
    for (unsigned i = 0; i < 3; ++i) {
      const String raw = server.arg(names[i]); char *end = nullptr;
      *fields[i] = strtof(raw.c_str(), &end);
      if (!raw.length() || end == raw.c_str() || *end || !isfinite(*fields[i]) || *fields[i] <= 0 || *fields[i] > (i == 0 ? 100000 : 10000)) {
        server.send(400, "text/plain", "PPR: 1..100000; wheel mm and ratio: >0..10000"); return;
      }
    }
    const EncoderConfig old = getEncoderConfig();
    if (floorf(config.ppr) != config.ppr) { server.send(400, "text/plain", "PPR must be an integer"); return; }
    if (old.ppr != config.ppr || old.wheelMm != config.wheelMm || old.ratio != config.ratio) {
      if (!logPreferencesReady || logPreferences.putBytes("encoder", &config, sizeof(config)) != sizeof(config)) {
        server.send(500, "text/plain", "Could not save encoder config"); return;
      }
      { Lock lock(stateMutex); encoderConfig = config; dashboard.encoder.rpmValid = dashboard.encoder.speedValid = false; }
    }
    server.send(200, "application/json", "{\"saved\":true}");
  });
  server.on("/", HTTP_GET, [&]() {
    server.sendHeader("Content-Encoding", "gzip");
    server.sendHeader("Cache-Control", "no-cache");
    server.send_P(200, "text/html; charset=utf-8", reinterpret_cast<const char *>(DASHBOARD_GZIP), sizeof(DASHBOARD_GZIP));
  });
  server.on("/api/state", HTTP_GET, [&]() {
    String header = csvHeader(); header.trim();
    String recorded = "[";
    LogRecord buffered;
    for (unsigned delivered = 0;
         delivered < 8 && xQueueReceive(webRecords, &buffered, 0) == pdTRUE;
         ++delivered) {
      if (delivered) recorded += ",";
      String bufferedRow = csvRow(buffered); bufferedRow.trim();
      const auto &bufferedPower = buffered.state.supply12v;
      const bool bufferedKnown = fresh(bufferedPower.valid, buffered.capturedMs,
                                       bufferedPower.updatedMs, 1000);
      const char *bufferedSupply = !SUPPLY_MONITOR_ENABLED ? "manual" :
        bufferedKnown ? (bufferedPower.present ? "on" : "off") : "unknown";
      recorded += "{\"captured_ms\":" + String(buffered.capturedMs);
      recorded += ",\"recording_session\":" + String(buffered.recordingSession);
      recorded += ",\"interval_ms\":" + String(buffered.intervalMs);
      recorded += ",\"devices_mask\":" + String(buffered.devicesMask);
      recorded += ",\"supply\":\"" + String(bufferedSupply) + "\"";
      recorded += ",\"csv\":\"" + bufferedRow + "\"}";
    }
    recorded += "]";
    const unsigned recordBufferPending = uxQueueMessagesWaiting(webRecords);
    // Capture the live preview after draining buffered records. This guarantees
    // its uptime cannot precede a sample returned in the same response.
    LogRecord record;
    record.state = getDashboardSnapshot();
    record.capturedMs = millis();
    record.sequence = ++webSequence;
    record.supplyEnabled = supplyBusEnabled.load();
    const auto &power = record.state.supply12v;
    const bool known = fresh(power.valid, record.capturedMs, power.updatedMs, 1000);
    String row = csvRow(record); row.trim();
    // Header and row contain only fixed field names, numeric fields and RTC
    // digits/separators, never user input or quotes.
    String json; json.reserve(header.length() + row.length() + recorded.length() + 1000);
    json = "{\"boot\":\"" + bootId + "\",\"supply\":\"";
    json += !SUPPLY_MONITOR_ENABLED ? "manual" : known ? (power.present ? "on" : "off") : "unknown";
    json += "\",\"interval_ms\":" + String(record.intervalMs) + ",\"header\":\"" + header + "\",\"csv\":\"" + row + "\",\"devices_mask\":" + String(enabledDevices.load()) + ",\"control_revision\":" + String(deviceControlRevision);
    const EncoderConfig config = getEncoderConfig();
    const ShuntConfig shunts = getShuntConfig();
    const uint32_t token = recordingToken.load();
    json += ",\"recording\":" + String((token & 1) ? "true" : "false");
    json += ",\"recording_session\":" + String(token >> 1);
    json += ",\"ds_pins\":[27,16,13,14],\"ds_rom\":" + dsMapJson();
    json += ",\"ga_step_ms\":" + String(gaStepMs.load());
    json += ",\"sd_available\":" + String(ENABLE_SD_LOGGING ? "true" : "false");
    json += ",\"sd_status\":\"" + String(ENABLE_SD_LOGGING && deviceEnabled(DEV_SD) ? sdStatus.load() : "DISABLED") + "\"";
    json += ",\"sd_mounted\":" + String(sdMounted.load() ? "true" : "false");
    json += ",\"sd_card_mib\":" + String(sdCardMiB.load());
    json += ",\"sd_written\":" + String(sdWritten.load());
    json += ",\"sd_dropped\":" + String(sdDropped.load());
    json += ",\"record_samples\":" + recorded;
    json += ",\"record_buffer_pending\":" + String(recordBufferPending);
    json += ",\"record_buffer_dropped\":" + String(webRecordDropped.load());
    json += ",\"blink_ms\":" + String(debugBlinkMs.load());
    json += ",\"shunt_mohm\":[" + String(shunts.mohm[0], 4) + "," + String(shunts.mohm[1], 4) + "," + String(shunts.mohm[2], 4) + "]";
    const auto &mcp = record.state.mcp;
    json += ",\"encoder_config\":{\"ppr\":" + String(config.ppr, 4) + ",\"wheel_mm\":" + String(config.wheelMm, 4) + ",\"ratio\":" + String(config.ratio, 4) + "}";
    json += ",\"ga\":{\"valid\":" + String(mcp.valid && fresh(mcp.valid, record.capturedMs, mcp.updatedMs, 1000) ? "true" : "false");
    json += ",\"mask\":" + String(mcp.portA & 15) + ",\"commanded\":" + String(mcp.commandedOutputs) + ",\"chase\":" + String(mcp.chase ? "true" : "false");
    json += ",\"stop_failed\":" + String(mcpStopFailed.load() ? "true" : "false") + "}}";
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });
  server.onNotFound([&]() { server.send(404, "text/plain", "Not found"); });
  bool started = false;
  uint32_t lastRetry = millis();
  for (;;) {
    if (WiFi.status() == WL_CONNECTED) {
      if (!started) {
        server.begin(); started = true;
        logf("Wi-Fi dashboard: http://%s (same Wi-Fi network)\n", WiFi.localIP().toString().c_str());
      }
      server.handleClient();
    } else {
      if (started) { server.stop(); started = false; }
      if (millis() - lastRetry >= 15000) {
        logLine("Wi-Fi: waiting for 2.4 GHz network; reconnecting");
        WiFi.reconnect(); lastRetry = millis();
      }
    }
    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

