poommyroboticcamera-netizen/DATA-Logging-Dashboard-esp32/src/main.cpp
// Desktop protocol: @H,<CSV header> and @D,<on|off|unknown|manual>,<CSV row>.
// One UART writer owns both telemetry and human-readable diagnostics.
void consoleTask(void *) {
  uint32_t lastPrint = 0, lastHeader = 0;
  uint32_t telemetrySequence = 0;
  bool streaming = false;
  String lastWebIp;
  for (;;) {
    if (SERIAL_IP_ONLY) {
      // Print once per connection/IP change; sensor data stays on the web.
      if (WiFi.status() == WL_CONNECTED) {
        const String ip = WiFi.localIP().toString();
        if (ip != "0.0.0.0" && ip != lastWebIp) {
          Serial.printf("http://%s/\n", ip.c_str());
          lastWebIp = ip;
        }
      } else {
        lastWebIp = "";
      }
      // Ignore legacy telemetry commands in IP-only mode.
      for (unsigned i = 0; i < 64 && Serial.available(); ++i) Serial.read();
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }
    for (unsigned i = 0; i < 16 && Serial.available(); i++) {
      const char command = char(Serial.read());
      if (command == 'j' || command == 'J') {
        streaming = true;
        lastHeader = millis() - 2000;
      } else if (command == 'v' || command == 'V') streaming = false;
      else dispatchCommand(command);
    }
    LogMessage message;
    for (unsigned i = 0; i < 16 && xQueueReceive(logQueue, &message, 0) == pdTRUE; i++)
      if (!streaming) Serial.print(message.text);
    if (streaming) {
      if (millis() - lastHeader >= 2000) {
        lastHeader = millis();
        Serial.print("@H,");
        Serial.print(csvHeader());
      }
      if (millis() - lastPrint >= 200) {
        lastPrint = millis();
        LogRecord record;
        record.sequence = ++telemetrySequence;
        record.state = getDashboardSnapshot();
        record.capturedMs = millis();
        record.supplyEnabled = supplyBusEnabled.load();
        const auto &power = record.state.supply12v;
        const bool known = fresh(power.valid, record.capturedMs, power.updatedMs, 1000);
        Serial.print("@D,");
        Serial.print(!SUPPLY_MONITOR_ENABLED ? "manual," : known ? (power.present ? "on," : "off,") : "unknown,");
        Serial.print(csvRow(record));
      }
    } else if (millis() - lastPrint >= 1000) {
      lastPrint = millis();
      printDashboard();
      Serial.printf("SD mounted=%u written=%lu dropped=%lu\n", sdMounted.load(),
                    (unsigned long)sdWritten.load(), (unsigned long)sdDropped.load());
    }
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

// ============================================================
// Setup / loop
// ============================================================
void setup() {
  pinMode(DEBUG_LED_PIN, OUTPUT);
  digitalWrite(DEBUG_LED_PIN, DEBUG_LED_OFF);
  Serial.begin(115200);
  Serial.setDebugOutput(false);
  delay(1000);
  const esp_reset_reason_t reason = esp_reset_reason();
  if (reason != ESP_RST_POWERON && reason != ESP_RST_EXT && reason != ESP_RST_DEEPSLEEP)
    Serial.printf("RESET: %s (%d)\n", resetReasonName(reason), int(reason));

  logLine("\n========================================");
  logLine("ESP32 DASHBOARD - FREERTOS 6 DEVICE TEST");
  logLine("INA226 x3 + MCP7940N + MCP23017 + MPU6050/MPU6500");
  logLine("========================================");

  logf("SDA=%d SCL=%d I2C=%lu Hz\n",
                SDA_PIN, SCL_PIN,
                static_cast<unsigned long>(I2C_SPEED));

  if (!Wire.begin(SDA_PIN, SCL_PIN, I2C_SPEED)) {
    logLine("I2C initialization FAILED");

    while (true) {
      delay(1000);
    }
  }

  Wire.setTimeOut(50);
  if (SUPPLY_MONITOR_ENABLED) {
    pinMode(VC12V_PIN, INPUT);
    analogReadResolution(12);
    analogSetPinAttenuation(VC12V_PIN, ADC_11db);
  }

  i2cMutex = xSemaphoreCreateMutex();
  stateMutex = xSemaphoreCreateMutex();
  imuCommands = xQueueCreate(8, sizeof(char));
  mcpCommands = xQueueCreate(8, sizeof(char));
  sensorCommands = xQueueCreate(8, sizeof(char));
  logQueue = xQueueCreate(32, sizeof(LogMessage));
  if (!i2cMutex || !stateMutex || !imuCommands || !mcpCommands ||
      !sensorCommands || !logQueue) {
    Serial.println("FATAL: RTOS allocation failed; reset board");
    while (true) delay(1000);
  }
  if (SUPPLY_MONITOR_ENABLED) sampleSupply();
  else {
    // Initialize the sensor generation before any device owner task starts.
    supplyGeneration.fetch_add(1);
    supplyBusEnabled.store(true);
    logLine("Supply monitor DISABLED: GPIO15 ADC off; sensors enabled; Wi-Fi stays on");
  }
  loadLogSettings();
  logf("Recording interval: %lu ms\n", (unsigned long)logIntervalMs.load());
  printHelp();

  // Device owners initialize only after the supply gate opens.
  // ESP-IDF task stack sizes are in bytes. Start console last.
  sdRecords = xQueueCreate(12, sizeof(LogRecord));
  // 32 samples retain 3.2 seconds at the fastest supported 100 ms interval.
  // The API drains up to eight on every response, so normal Wi-Fi jitter does
  // not remove rows from the browser CSV.
  webRecords = xQueueCreate(32, sizeof(LogRecord));
  if (!sdRecords || !webRecords) {
    Serial.println("FATAL: record queue allocation failed");
    while (true) delay(1000);
  }
  TaskHandle_t handles[12] = {};
  bool ok = true;
  if (SUPPLY_MONITOR_ENABLED)
    ok = xTaskCreatePinnedToCore(supplyTask, "supply", 3072, nullptr, 4, &handles[4], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(imuTask, "imu", 4096, nullptr, 3, &handles[0], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(mcpTask, "mcp", 3072, nullptr, 2, &handles[1], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(sensorTask, "sensors", 4096, nullptr, 1, &handles[2], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(dhtTask, "dht", 3072, nullptr, 1, &handles[10], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(temperatureTask, "temperature", 4096, nullptr, 1, &handles[5], SENSOR_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(recordingControlTask, "recordControl", 3072, nullptr, 2, &handles[11], SENSOR_CORE) == pdPASS;
  // Recording snapshots share IMU priority so a busy sensor cycle cannot
  // postpone the requested capture interval.
  if (ok) ok = xTaskCreatePinnedToCore(logCaptureTask, "logCapture", 4096, nullptr, 3, &handles[6], SENSOR_CORE) == pdPASS;
  if (ok && ENABLE_SD_LOGGING) ok = xTaskCreatePinnedToCore(sdWriterTask, "sdWriter", 8192, nullptr, 1, &handles[7], WEB_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(encoderTask, "encoder", 4096, nullptr, 2, &handles[8], SENSOR_CORE) == pdPASS;
  // Keep API polling ahead of SD/console work; browser recording depends on
  // receiving each state response on time.
  if (ok) ok = xTaskCreatePinnedToCore(wifiTask, "wifiWeb", 12288, nullptr, 2, &handles[9], WEB_CORE) == pdPASS;
  if (ok) ok = xTaskCreatePinnedToCore(consoleTask, "console", 6144, nullptr, 1, &handles[3], WEB_CORE) == pdPASS;
  if (!ok) {
    Serial.println("FATAL: task creation failed; restarting");
    delay(100);
    ESP.restart();
  }
}

void loop() {
  // Arduino loop task has no application work; workers own all devices.
  vTaskDelay(pdMS_TO_TICKS(1000));
}
